{
  "personalInfo": {
    "name": "Andrey Luiz",
    "title": "Senior Full Stack Engineer",
    "email": "andreyluiz.developer@gmail.com",
    "phone": "+41 76 503 86 65",
    "location": "Fribourg, Switzerland",
    "website": "andreyluiz.com",
    "linkedin": "linkedin.com/in/andreyluiz"
  },
  "skills": {
    "programmingLanguages": ["JavaScript", "TypeScript", "C#"],
    "technologies": [
      "React",
      "Node.js",
      "SvelteKit",
      "Next.js",
      "Phaser",
      "PostgreSQL",
      "MongoDB",
      "Git",
      "AWS"
    ]
  },
  "experience": [
    {
      "title": "Full Stack Engineer",
      "company": "Timeleap",
      "location": "Switzerland",
      "period": {
        "start": "July 2024",
        "end": "January 2025"
      },
      "achievements": [
        "Led the continuous development of clients' decentralized applications using SvelteKit and TypeScript, granting the company a net revenue of more than 50k CHF in the first months of operation.",
        "Spearheaded enhancements on core functionalities within the Unchained platform leveraging TypeScript, contributing to the production readiness.",
        "Developed a Phaser game for our client's staking portal, ensuring smooth gameplay and user engagement."
      ],
      "techStack": [
        "SvelteKit",
        "TypeScript",
        "MongoDB",
        "PostgreSQL",
        "TailwindCSS",
        "Phaser",
        "AWS"
      ]
    },
    {
      "title": "Frontend Engineer",
      "company": "Sonar",
      "location": "Switzerland",
      "period": {
        "start": "November 2022",
        "end": "June 2024"
      },
      "achievements": [
        "Executed three key features for SonarCloud's project section in React, streamlining the Clean Code Taxonomy integration and educating users on best practices in coding standards.",
        "Pioneered the CaYC team's efforts, identifying and deploying 8 critical features to integrate CaYC methodology across product lines, facilitating team-wide communication and workflow efficiency.",
        "Improved SonarCloud's issues screen by migrating to MIUI using React, enhancing user experience and UI consistency."
      ],
      "techStack": ["React", "TypeScript", "TailwindCSS", "Git", "AWS"]
    },
    {
      "title": "Full Stack Engineer",
      "company": "Equip",
      "location": "Switzerland",
      "period": {
        "start": "June 2021",
        "end": "November 2022"
      },
      "achievements": [
        "Led the enhancement of the Equip app, refining both map search and rental processes within the on-demand sports equipment platform, thereby accelerating prototype development in 3 months.",
        "Improved the Bluetooth connection from the app to the rental stations, improving reliability from 1 among 5 successful attempts, to 5 among 5 successful attempts.",
        "Published the app on Play Store and Apple Store, facilitating the reach of the company to leads and customers in Switzerland, France, and the US."
      ],
      "techStack": ["Meteor.js", "Svelte", "MongoDB", "Git", "AWS", "Cordova"]
    },
    {
      "title": "Frontend Engineer",
      "company": "Scout24 Schweiz AG",
      "location": "Switzerland",
      "period": {
        "start": "February 2020",
        "end": "September 2021"
      },
      "achievements": [
        "Led valuable contributions into developing Anibis messenger using React and TypeScript, granting constant improvements to the user experience.",
        "Managed the transition of messaging services from Twilio to Sendbird, overhauling the React application to optimize maintainability, supporting 100% of the company's users in the first month.",
        "Performed as a Scrum Master for the Aldrin squad, ensuring the team's communication and productivity."
      ],
      "techStack": ["React", "Redux", "TypeScript", "Git", "AWS"]
    },
    {
      "title": "Full Stack Engineer",
      "company": "Integer Consulting",
      "location": "Portugal",
      "period": {
        "start": "February 2018",
        "end": "January 2020"
      },
      "achievements": [
        "Created 3 React components for Adobe Content Manager for a leading energy company from Germany and the UK, improving the catalog of available components for content managers.",
        "Implemented features in React for the SkyQ application of British Sky Broadcasting for Germany and Austria, improving user experience and application availability.",
        "Researched and executed important features for SkyQ for PlayStation 4, including all the processes of deployment and release in the store, spreading even more the availability of the company's product."
      ],
      "techStack": [
        "React",
        "Redux",
        "PostgreSQL",
        "TypeScript",
        "Git",
        "Python"
      ]
    },
    {
      "title": "Frontend Engineer",
      "company": "DataRisk",
      "location": "Brazil",
      "period": {
        "start": "January 2017",
        "end": "February 2018"
      },
      "achievements": [
        "Researched and started the company's main front-end application from scratch using React and Redux, starting the company's business idea and vision, and making the company's first product available for beta testing by two customers.",
        "Played a crucial role as the first front-end developer, collaborating closely with a designer to launch the application into beta testing, a significant milestone for the company's growth."
      ],
      "techStack": ["React", "Redux", "JavaScript", "Git"]
    },
    {
      "title": "Frontend Engineer",
      "company": "Resultados Digitais",
      "location": "Brazil",
      "period": {
        "start": "April 2016",
        "end": "December 2016"
      },
      "achievements": [
        "Conceived important features in JavaScript and jQuery for the Landing Pages squad, ensuring quality and customer support.",
        "Integrated the effort to migrate the landing pages editor to a WYSIWYG editor, improving the user experience while creating landing pages.",
        "Collaborated with decisions and actions for the front-end chapter of the company, always ensuring the front-end development had a bright future ahead."
      ],
      "techStack": ["JavaScript", "jQuery", "Git"]
    },
    {
      "title": "Frontend Developer",
      "company": "Kanoah",
      "location": "Brazil",
      "period": {
        "start": "June 2015",
        "end": "December 2015"
      },
      "achievements": [
        "Implemented features for a JIRA plugin for testing management using Angular.js, giving the company the first international customers.",
        "Led the front-end development of the core feature of testing suites, allowing the company to outperform competitors."
      ],
      "techStack": ["Angular.js", "JavaScript", "Git"]
    },
    {
      "title": "Full Stack Developer",
      "company": "Softplan Planejamento e Sistemas",
      "location": "Brazil",
      "period": {
        "start": "March 2014",
        "end": "June 2015"
      },
      "achievements": [
        "Engineered critical features for a Java-based file processing tool, directly enhancing data analysis capabilities and boosting the company's reputation in financial software.",
        "Created and optimized queries on PostgreSQL database for fast data querying.",
        "Pioneered on JavaScript and CSS rich interfaces, giving users a more intuitive and user-friendly experience."
      ],
      "techStack": ["Java", "JSP", "PostgreSQL", "JavaScript", "Git"]
    }
  ],
  "education": [
    {
      "degree": "AWS Certified Cloud Practitioner",
      "institution": "Amazon Web Services",
      "year": "October 2023",
      "location": "Switzerland"
    },
    {
      "degree": "Diploma in Software Engineering and Development",
      "institution": "Faculdade Unilagos",
      "year": "December 2011",
      "location": "Brazil"
    }
  ],
  "languages": [
    {
      "name": "Portuguese",
      "level": "Native"
    },
    {
      "name": "English",
      "level": "Full Professional"
    },
    {
      "name": "French",
      "level": "Limited Working"
    },
    {
      "name": "German",
      "level": "Elementary"
    }
  ],
  "publications": [
    {
      "title": "Bot Seeker®, an Automated Profile Recognition Software on Twitter",
      "location": "ResearchGate",
      "url": "https://www.researchgate.net/publication/353804679_Bot_SeekerR_an_Automated_Profile_Recognition_Software_on_Twitter"
    },
    {
      "title": "Robots, lies and misinformation in Venezuela. Identifying automated Twitter profiles of the Telesur and Vtv media",
      "location": "ResearchGate",
      "url": "https://www.researchgate.net/publication/339788432_Robots_lies_and_misinformation_in_Venezuela_Identifying_automated_Twitter_profiles_of_the_Telesur_and_Vtv_media"
    }
  ]
}
