{
  "name": "Andrey Luiz",
  "title": "Développeur Frontend Senior",
  "contactInfo": {
    "email": "andreyluiz.developer@gmail.com",
    "phone": "+41 76 503 86 65",
    "location": "Fribourg, Suisse",
    "website": "andreyluiz.com",
    "linkedin": "linkedin.com/in/andreyluiz"
  },
  "summary": "Développeur frontend avec plus de 12 ans d'expérience, spécialisé dans les frameworks JavaScript, TypeScript, React et les technologies frontend modernes. Expert en développement web et mobile, avec une vaste expérience en React Native pour les applications multiplateformes. A travaillé sur des applications pour Smart TVs et PS4, du développement avec React jusqu'à l'approbation et le lancement. A amélioré l'expérience utilisateur et stimulé la croissance des affaires dans des entreprises suisses réputées comme SonarSource et Scout24. A développé et lancé avec succès plusieurs applications React Native sur Google Play et Apple Store, étendant la portée de l'entreprise dans différents pays.",
  "skills": [
    {
      "domain": "Frontend",
      "skills": ["React", "TailwindCSS", "TypeScript", "Redux", "Phaser.js"]
    },
    {
      "domain": "Mobile",
      "skills": [
        "React Native",
        "Expo",
        "iOS",
        "Android",
        "Apple Store",
        "Google Play"
      ]
    },
    {
      "domain": "Full-Stack & Bases de données",
      "skills": ["Node.js", "Next.js", "SvelteKit", "MongoDB", "PostgreSQL"]
    },
    {
      "domain": "Outils & Plateformes",
      "skills": ["Git", "AWS", "CI/CD", "Docker", "Supabase"]
    }
  ],
  "experience": [
    {
      "title": "Développeur Frontend Senior",
      "company": "Sonar",
      "location": "Suisse",
      "period": {
        "start": "Novembre 2022",
        "end": "Juin 2024"
      },
      "achievements": [
        "A livré trois fonctionnalités clés pour la section projet de SonarCloud en React, intégrant des APIs RESTful pour améliorer la récupération de données et optimiser l'intégration de la Taxonomie du Code Propre et l'éducation des utilisateurs sur les meilleures pratiques de codage.",
        "A été le pionnier de l'adoption de 8 fonctionnalités critiques par l'équipe CaYC, rationalisant l'efficacité du flux de travail et la collaboration inter-équipes.",
        "A migré l'écran des problèmes de SonarCloud vers MIUI en utilisant React, recevant des retours positifs de la direction senior pour avoir amélioré le flux de travail quotidien des développeurs."
      ],
      "techStack": ["React", "TypeScript", "TailwindCSS", "Git", "AWS"]
    },
    {
      "title": "Développeur Full Stack Senior",
      "company": "Equip",
      "location": "Suisse",
      "period": {
        "start": "Juin 2021",
        "end": "Novembre 2022"
      },
      "achievements": [
        "A amélioré la recherche sur carte et les processus de location de l'application Equip, réduisant le temps de développement du prototype de 3 mois.",
        "A optimisé les capacités Bluetooth de l'application hybride pour la connexion avec les stations de location, augmentant la fiabilité de 20% à 100%.",
        "A lancé l'application Equip sur Play Store et Apple Store, étendant la portée de l'entreprise dans trois pays."
      ],
      "techStack": ["Meteor.js", "Svelte", "MongoDB", "Git", "AWS", "Cordova"]
    },
    {
      "title": "Développeur Frontend Senior",
      "company": "Scout24 Schweiz AG",
      "location": "Suisse",
      "period": {
        "start": "Février 2020",
        "end": "Septembre 2021"
      },
      "achievements": [
        "A amélioré et refactorisé Anibis Messenger en utilisant React et TypeScript, obtenant des réactions positives de la direction.",
        "A migré les services de messagerie de Twilio vers Sendbird, assurant une adoption complète par 100% des utilisateurs dès le premier mois."
      ],
      "techStack": ["React", "Redux", "TypeScript", "Git", "AWS"]
    },
    {
      "title": "Développeur Full Stack Senior",
      "company": "Integer Consulting",
      "location": "Portugal",
      "period": {
        "start": "Février 2018",
        "end": "Janvier 2020"
      },
      "achievements": [
        "A mené de nouvelles fonctionnalités pour l'application SkyQ (British Sky Broadcasting), utilisant Redux pour la gestion d'état et le stockage local pour des performances optimisées, améliorant l'expérience utilisateur et la disponibilité dans tous les pays où le produit était présent.",
        "A créé et déployé des fonctionnalités clés pour SkyQ sur PlayStation 4, étendant la portée du produit via des lancements réussis en boutique."
      ],
      "techStack": [
        "React",
        "Redux",
        "PostgreSQL",
        "TypeScript",
        "Git",
        "Python"
      ]
    },
    {
      "title": "Développeur Front-end",
      "company": "Autres entreprises",
      "location": "Brésil",
      "period": {
        "start": "Juin 2015",
        "end": "Janvier 2018"
      },
      "achievements": [
        "A travaillé dans plusieurs startups au Brésil en tant que Développeur Frontend, comme Kanoah, DataRisk et Resultados Digitais.",
        "A dirigé des fonctionnalités importantes pour Kanoah Test Manager, un plugin JIRA pour la gestion des tests, aujourd'hui partie d'Adaptavist.",
        "A conçu la première version de l'éditeur WYSIWYG de pages d'atterrissage pour RD Station, chez Resultados Digitais.",
        "A développé de zéro la première version de la plateforme d'apprentissage automatique pour DataRisk.",
        "A utilisé des technologies comme React, Redux, JavaScript, Git, Angular.js, jQuery et plus encore."
      ],
      "techStack": [
        "React",
        "Redux",
        "JavaScript",
        "Git",
        "Angular.js",
        "jQuery"
      ]
    }
  ],
  "breaks": [
    {
      "period": {
        "start": "Juillet 2024",
        "end": "Présent"
      },
      "achievements": [
        "Gérer une transition familiale et déménager dans un autre canton pour explorer de nouvelles opportunités.",
        "Approfondir l'expertise en Rust, Python et .NET pour aider à orienter les futures décisions de carrière.",
        "Construire des projets personnels full-stack incluant andreyluiz.com, cv.andreyluiz.com et d'autres, pour maintenir les compétences aiguisées.",
        "Étudier comment l'IA façonne l'avenir du développement logiciel, appliqué aux ingénieurs seniors.",
        "Commencer la recherche d'emploi en janvier 2025 en cherchant des opportunités impactantes à long terme."
      ]
    }
  ],
  "certifications": [
    {
      "degree": "AWS Certified Cloud Practitioner",
      "institution": "Amazon Web Services",
      "year": "Octobre 2023",
      "location": "Suisse"
    }
  ],
  "education": [
    {
      "degree": "Diplôme en Ingénierie et Développement de Logiciels",
      "institution": "Faculdade Unilagos",
      "year": "Décembre 2011",
      "location": "Brésil"
    }
  ],
  "languages": [
    {
      "name": "Anglais",
      "level": "Professionnel Complet"
    },
    {
      "name": "Français",
      "level": "Professionnel Complet"
    },
    {
      "name": "Portugais",
      "level": "Natif"
    }
  ]
}
