{
  "name": "Andrey Luiz",
  "title": "Engenheiro Full Stack Sênior",
  "contactInfo": {
    "email": "andreyluiz.developer@gmail.com",
    "phone": "+41 76 503 86 65",
    "location": "Fribourg, Suíça",
    "website": "andreyluiz.com",
    "linkedin": "linkedin.com/in/andreyluiz"
  },
  "summary": "Engenheiro full stack com mais de 12 anos de experiência, especializado em frameworks JavaScript, TypeScript, Next.js, Python e AWS. Trabalhou em aplicativos para Smart TVs e PS4, desde o desenvolvimento com React até aprovação e lançamento. Melhorou a experiência do usuário e impulsionou o crescimento dos negócios em empresas suíças respeitadas como SonarSource e Scout24. Desenvolveu aplicativos prontos para produção com React Native e lançou na Google Play e Apple Store, expandindo o alcance da empresa em diferentes países.",
  "skills": [
    {
      "domain": "Frontend",
      "skills": ["React", "SvelteKit", "Next.js", "Phaser", "TailwindCSS"]
    },
    { "domain": "Backend", "skills": ["Node.js", "Python"] },
    { "domain": "Bancos de Dados", "skills": ["PostgreSQL", "MongoDB"] },
    { "domain": "DevOps & Cloud", "skills": ["AWS", "Git", "CI/CD"] }
  ],
  "experience": [
    {
      "title": "Engenheiro Frontend",
      "company": "Sonar",
      "location": "Suíça",
      "period": {
        "start": "Novembro 2022",
        "end": "Junho 2024"
      },
      "achievements": [
        "Entregou três funcionalidades principais para a seção de projetos do SonarCloud em React, integrando com APIs RESTful para melhorar a recuperação de dados e aprimorar a integração da Taxonomia de Código Limpo e a educação dos usuários sobre as melhores práticas de codificação.",
        "Pioneiro na adoção de 8 funcionalidades críticas pela equipe CaYC, otimizando a eficiência do fluxo de trabalho e a colaboração entre equipes.",
        "Migrou a tela de problemas do SonarCloud para MIUI usando React, recebendo feedback positivo da liderança sênior por melhorar o fluxo de trabalho diário dos desenvolvedores."
      ],
      "techStack": ["React", "TypeScript", "TailwindCSS", "Git", "AWS"]
    },
    {
      "title": "Engenheiro Full Stack",
      "company": "Equip",
      "location": "Suíça",
      "period": {
        "start": "Junho 2021",
        "end": "Novembro 2022"
      },
      "achievements": [
        "Aprimorou a busca no mapa e os processos de aluguel do aplicativo Equip, reduzindo o tempo de desenvolvimento do protótipo em 3 meses.",
        "Otimizou as capacidades Bluetooth do aplicativo híbrido para conexão com estações de aluguel, aumentando a confiabilidade de 20% para 100%.",
        "Lançou o aplicativo Equip na Play Store e Apple Store, expandindo o alcance da empresa em três países."
      ],
      "techStack": ["Meteor.js", "Svelte", "MongoDB", "Git", "AWS", "Cordova"]
    },
    {
      "title": "Engenheiro Frontend",
      "company": "Scout24 Schweiz AG",
      "location": "Suíça",
      "period": {
        "start": "Fevereiro 2020",
        "end": "Setembro 2021"
      },
      "achievements": [
        "Aprimorou e refatorou o Anibis Messenger usando React e TypeScript, obtendo reações positivas da gerência.",
        "Migrou os serviços de mensagens do Twilio para Sendbird, garantindo adoção total por 100% dos usuários no primeiro mês."
      ],
      "techStack": ["React", "Redux", "TypeScript", "Git", "AWS"]
    },
    {
      "title": "Engenheiro Full Stack",
      "company": "Integer Consulting",
      "location": "Portugal",
      "period": {
        "start": "Fevereiro 2018",
        "end": "Janeiro 2020"
      },
      "achievements": [
        "Desenvolveu novas funcionalidades para o aplicativo SkyQ (British Sky Broadcasting), utilizando Redux para gerenciamento de estado e armazenamento local para otimização de desempenho, melhorando a experiência do usuário e disponibilidade em todos os países onde o produto estava presente.",
        "Criou e implantou funcionalidades principais para SkyQ no PlayStation 4, expandindo o alcance do produto através de lançamentos bem-sucedidos na loja."
      ],
      "techStack": [
        "React",
        "Redux",
        "PostgreSQL",
        "TypeScript",
        "Git",
        "Python"
      ]
    },
    {
      "title": "Engenheiro Frontend",
      "company": "DataRisk",
      "location": "Brasil",
      "period": {
        "start": "Janeiro 2017",
        "end": "Fevereiro 2018"
      },
      "achievements": [
        "Liderou o desenvolvimento da aplicação frontend inicial da DataRisk utilizando React e Redux, permitindo que os três primeiros clientes testassem o novo produto inovador de machine learning.",
        "Dirigiu o desenvolvimento frontend, colaborando com designers para lançar o primeiro produto beta da empresa, conquistando os primeiros clientes."
      ],
      "techStack": ["React", "Redux", "JavaScript", "Git"]
    },
    {
      "title": "Engenheiro Frontend",
      "company": "Resultados Digitais",
      "location": "Brasil",
      "period": {
        "start": "Abril 2016",
        "end": "Dezembro 2016"
      },
      "achievements": [
        "Introduziu funcionalidades principais em JavaScript e jQuery para a equipe de Landing Pages, melhorando a qualidade do produto e a experiência do cliente.",
        "Migrou o editor de landing pages para uma interface WYSIWYG, melhorando a usabilidade e flexibilidade de design, e recebendo feedback positivo dos clientes nas primeiras semanas de lançamento."
      ],
      "techStack": ["JavaScript", "jQuery", "Git"]
    },
    {
      "title": "Desenvolvedor Frontend",
      "company": "Kanoah",
      "location": "Brasil",
      "period": {
        "start": "Junho 2015",
        "end": "Dezembro 2015"
      },
      "achievements": [
        "Desenvolveu funcionalidades para um plugin de gerenciamento de testes JIRA usando Angular.js, ajudando a Kanoah a conquistar os primeiros clientes internacionais.",
        "Liderou o desenvolvimento frontend para suites de testes, melhorando a competitividade da Kanoah no mercado."
      ],
      "techStack": ["Angular.js", "JavaScript", "Git"]
    }
  ],
  "breaks": [
    {
      "period": {
        "start": "Julho 2024",
        "end": "Presente"
      },
      "achievements": [
        "Gerenciar uma transição familiar e mudar para outro cantão para explorar novas oportunidades.",
        "Aprofundar conhecimentos em Rust, Python e .NET para ajudar a guiar decisões futuras de carreira.",
        "Construir projetos pessoais full-stack incluindo andreyluiz.com, cv.andreyluiz.com e outros, para manter as habilidades afiadas.",
        "Estudar como a IA está moldando o futuro do desenvolvimento de software, aplicado a engenheiros seniores.",
        "Iniciar busca por emprego em janeiro de 2025 procurando oportunidades impactantes de longo prazo."
      ]
    }
  ],
  "certifications": [
    {
      "degree": "AWS Certified Cloud Practitioner",
      "institution": "Amazon Web Services",
      "year": "Outubro 2023",
      "location": "Suíça"
    }
  ],
  "education": [
    {
      "degree": "Diploma em Engenharia e Desenvolvimento de Software",
      "institution": "Faculdade Unilagos",
      "year": "Dezembro 2011",
      "location": "Brasil"
    }
  ],
  "languages": [
    {
      "name": "Inglês",
      "level": "Profissional Completo"
    },
    {
      "name": "Francês",
      "level": "Conhecimento Limitado"
    },
    {
      "name": "Português",
      "level": "Nativo"
    }
  ]
}
