{
  "name": "Andrey Luiz",
  "title": "Ingénieur logiciel principal",
  "contactInfo": {
    "email": "andreyluiz.developer@gmail.com",
    "phone": "+41 76 503 86 65",
    "location": "Fribourg, Suisse",
    "github": "github.com/andreyluiz",
    "linkedin": "linkedin.com/in/andreyluiz",
    "website": "andreyluiz.com"
  },
  "summary": "Je suis un ingénieur logiciel principal avec plus de 14 ans d'expérience en développement logiciel, principalement axé sur la qualité et la valeur pour le client. Mon expérience industrielle couvre le SaaS, le Web3 et le Sport, travaillant toujours en étroite collaboration avec les Product Owners avec ma vision innovante et axée sur les résultats. Je recherche un poste d'ingénieur logiciel principal ou d'ingénieur logiciel senior, où je peux tirer parti de mon expertise en développement logiciel et de mon leadership pour stimuler les résultats de l'équipe et la valeur du produit.",
  "generalSkills": [
    "Développer des applications full-stack évolutives et maintenables",
    "Concevoir des applications mobiles attrayantes et fonctionnelles",
    "Construire des interfaces utilisateur avec une excellente UX",
    "Collaborer efficacement au sein d'équipes agiles interfonctionnelles",
    "Plaider pour des approches de conception centrées sur l'utilisateur",
    "Encadrer et guider les développeurs juniors",
    "Piloter les métriques et les indicateurs clés de performance (KPI) pour mesurer le succès"
  ],
  "skills": [
    {
      "domain": "Frontend",
      "skills": ["React", "TailwindCSS", "TypeScript", "Redux", "Phaser.js"]
    },
    {
      "domain": "Mobile",
      "skills": [
        "React Native",
        "Expo",
        "iOS",
        "Android",
        "Apple Store",
        "Google Play"
      ]
    },
    {
      "domain": "Full-Stack & Bases de données",
      "skills": [
        "Python",
        "FastAPI",
        "Flask",
        "Node.js",
        "Next.js",
        "SvelteKit",
        "Java",
        "MongoDB",
        "PostgreSQL"
      ]
    },
    {
      "domain": "Outils d'IA",
      "skills": [
        "Cursor",
        "Cline",
        "Gemini CLI",
        "Claude",
        "Gemini",
        "OpenAI",
        "ChatGPT"
      ]
    },
    {
      "domain": "Outils & Plateformes",
      "skills": ["Git", "AWS", "CI/CD", "Docker", "Supabase"]
    }
  ],
  "experience": [
    {
      "title": "Ingénieur full-stack",
      "company": "Timeleap",
      "location": "Suisse",
      "period": {
        "start": "Juil 2024",
        "end": "Janv 2025"
      },
      "achievements": [
        "Développement de projets Web3 avec SvelteKit, en intégrant divers types de blockchains et de contrats intelligents.",
        "Mise en œuvre d'une application de portefeuille React Native pour un grand client indien, en l'intégrant à une blockchain sur mesure et en sécurisant les premiers enjeux.",
        "Création d'un jeu avec Phaser.js pour un portail de staking, recevant des retours positifs du client et attirant 600 joueurs le premier mois."
      ]
    },
    {
      "title": "Développeur front-end senior",
      "company": "Sonar",
      "location": "Suisse",
      "period": {
        "start": "Nov 2022",
        "end": "Juin 2024"
      },
      "achievements": [
        "Livraison de trois fonctionnalités clés pour la section projet de SonarCloud en React, en les intégrant avec des API RESTful pour améliorer la récupération des données et améliorer l'intégration de la taxonomie Clean Code et l'éducation des utilisateurs sur les meilleures pratiques de codage.",
        "Pionnier de l'adoption par l'équipe CaYC de 8 fonctionnalités critiques, en utilisant React et TypeScript, optimisant l'efficacité des workflows et la collaboration inter-équipes.",
        "Migration de l'écran des problèmes de SonarCloud vers MIUI avec React, recevant des retours positifs de la direction pour l'amélioration du workflow quotidien des développeurs."
      ]
    },
    {
      "title": "Développeur full-stack senior",
      "company": "Equip",
      "location": "Suisse",
      "period": {
        "start": "Juin 2021",
        "end": "Nov 2022"
      },
      "achievements": [
        "Amélioration des processus de recherche sur carte et de location de l'application Equip avec Svelte et TypeScript, réduisant le temps de développement des prototypes de 3 mois.",
        "Lancement de l'application Equip sur le Play Store et l'Apple Store, étendant la portée de l'entreprise à trois pays.",
        "Refactorisation de la base de code de l'application Equip avec React Native et TypeScript, réduisant le temps d'itération sur les nouvelles fonctionnalités."
      ]
    },
    {
      "title": "Développeur front-end senior",
      "company": "Scout24",
      "location": "Suisse",
      "period": {
        "start": "Févr 2020",
        "end": "Sept 2021"
      },
      "achievements": [
        "Amélioration et refactorisation d'Anibis Messenger avec React et TypeScript, obtenant des réactions positives de la direction.",
        "Migration des services de messagerie de Twilio vers Sendbird, assurant une adoption complète par 100% des utilisateurs dès le premier mois.",
        "A agi en tant que Scrum Master pour l'équipe, dirigeant les réunions quotidiennes et les sessions de planification de sprint, améliorant la collaboration et la productivité de l'équipe."
      ]
    },
    {
      "title": "Développeur front-end senior",
      "company": "Integer Consulting",
      "location": "Portugal",
      "period": {
        "start": "Févr 2018",
        "end": "Janv 2020"
      },
      "achievements": [
        "Collaboration sur de nouvelles fonctionnalités pour l'application SkyQ (British Sky Broadcasting) avec React et Redux, améliorant les temps de chargement sur les anciens téléviseurs de 20 à 1 seconde.",
        "Création et déploiement de fonctionnalités clés pour SkyQ sur PlayStation 4, élargissant la portée du produit grâce à des lancements réussis sur le store.",
        "Création d'un outil interne en Python pour traiter les journaux des caméras de sécurité, améliorant l'analyse des données et la surveillance de la sécurité."
      ]
    },
    {
      "title": "Développeur front-end",
      "company": "DataRisk",
      "location": "Brésil",
      "isPrevious": true,
      "period": {
        "start": "Janv 2017",
        "end": "Févr 2018"
      },
      "achievements": [
        "Recherche et démarrage de l'application front-end principale de l'entreprise à partir de zéro avec React et Redux, lançant l'idée commerciale et la vision de l'entreprise, et rendant le premier produit de l'entreprise disponible pour des tests bêta par deux clients.",
        "A joué un rôle crucial en tant que premier développeur front-end, collaborant étroitement avec un designer pour lancer l'application en phase de test bêta, une étape importante pour la croissance de l'entreprise."
      ]
    },
    {
      "title": "Développeur front-end",
      "company": "Resultados Digitais",
      "location": "Brésil",
      "isPrevious": true,
      "period": {
        "start": "Avr 2016",
        "end": "Déc 2016"
      },
      "achievements": [
        "Conception de fonctionnalités importantes en JavaScript et jQuery pour l'équipe des Landing Pages, garantissant la qualité et le support client.",
        "Intégration de l'effort de migration de l'éditeur de pages de destination vers un éditeur WYSIWYG, améliorant l'expérience utilisateur lors de la création de pages de destination.",
        "Collaboration aux décisions et actions pour le chapitre front-end de l'entreprise, en veillant toujours à ce que le développement front-end ait un avenir prometteur."
      ]
    },
    {
      "title": "Développeur front-end",
      "company": "Kanoah",
      "location": "Brésil",
      "isPrevious": true,
      "period": {
        "start": "Juin 2015",
        "end": "Déc 2015"
      },
      "achievements": [
        "Mise en œuvre de fonctionnalités pour un plugin JIRA pour la gestion des tests avec Angular.js, apportant à l'entreprise ses premiers clients internationaux.",
        "Direction du développement front-end de la fonctionnalité principale des suites de tests, permettant à l'entreprise de surpasser ses concurrents."
      ]
    },
    {
      "title": "Développeur full-stack",
      "company": "Softplan",
      "location": "Brésil",
      "isPrevious": true,
      "period": {
        "start": "Mar 2014",
        "end": "Juin 2015"
      },
      "achievements": [
        "Conception de fonctionnalités critiques pour un outil de traitement de fichiers basé sur Java, améliorant directement les capacités d'analyse de données et renforçant la réputation de l'entreprise dans le domaine des logiciels financiers.",
        "Création et optimisation de requêtes sur la base de données PostgreSQL pour une interrogation rapide des données.",
        "Pionnier des interfaces riches en JavaScript et CSS, offrant aux utilisateurs une expérience plus intuitive et conviviale."
      ]
    }
  ],
  "certifications": [
    {
      "degree": "Certifié AWS Cloud Practitioner",
      "institution": "Amazon Web Services",
      "year": "Oct 2023",
      "location": "Suisse"
    }
  ],
  "education": [
    {
      "degree": "Baccalauréat en génie logiciel et développement",
      "institution": "Université Unilagos",
      "year": "Déc 2011",
      "location": "Brésil"
    }
  ],
  "languages": [
    {
      "name": "Anglais",
      "level": "Professionnel complet"
    },
    {
      "name": "Français",
      "level": "Professionnel limité"
    },
    {
      "name": "Portugais",
      "level": "Natif"
    }
  ],
  "personalityTraits": [
    "Ambitieux",
    "Calme",
    "Concentré",
    "Fiable",
    "Autonome",
    "Capable d'apprendre",
    "Orienté solutions",
    "Respectueux",
    "Responsable",
    "Communicatif"
  ]
}
