{
  "name": "Andrey Luiz",
  "title": "Senior Software Engineer",
  "contactInfo": {
    "email": "andreyluiz.developer@gmail.com",
    "phone": "+41 76 503 86 65",
    "location": "Fribourg, Switzerland",
    "github": "github.com/andreyluiz",
    "linkedin": "linkedin.com/in/andreyluiz",
    "website": "andreyluiz.com"
  },
  "summary": "Senior Software Engineer with 12+ years of experience in web and mobile development, focused on React, TypeScript, and AI tools. Led the adoption of critical features for SonarCloud's CaYC team, streamlining workflow efficiency. Developed Web3 projects, including a Web3 powered game, and a React Native wallet. Earned AWS Certified Cloud Practitioner certification.",
  "skills": [
    {
      "domain": "Frontend",
      "skills": ["React", "TailwindCSS", "TypeScript", "Redux", "Phaser.js"]
    },
    {
      "domain": "Mobile",
      "skills": [
        "React Native",
        "Expo",
        "iOS",
        "Android",
        "Apple Store",
        "Google Play"
      ]
    },
    {
      "domain": "Full-Stack & Databases",
      "skills": ["Python", "FastAPI", "Flask", "Node.js", "Next.js", "SvelteKit", "MongoDB", "PostgreSQL"]
    },
    {
      "domain": "AI Tools",
      "skills": ["Cursor", "Cline", "Gemini CLI", "Claude", "Gemini", "OpenAI", "ChatGPT"]
    },
    {
      "domain": "Tools & Platforms",
      "skills": ["Git", "AWS", "CI/CD", "Docker", "Supabase"]
    }
  ],
  "experience": [
    {
      "title": "Full Stack Engineer",
      "company": "Timeleap",
      "location": "Switzerland",
      "period": {
        "start": "Jul 2024",
        "end": "Jan 2025"
      },
      "achievements": [
        "Developed Web3 projects using SvelteKit, integrating with many types of blockchains and smart contracts.",
        "Implemented a React Native wallet application for a big client from India, integrating with a custom made blockchain and securing the first stakes.",
        "Crafted a game using Phaser.js for a staking portal, getting positive feedback from the client and granting 600 players in the first month."
      ],
      "techStack": ["SvelteKit", "React Native", "Phaser.js", "Node.js", "TypeScript", "Git", "AWS"]
    },
    {
      "title": "Senior Front-end Developer",
      "company": "Sonar",
      "location": "Switzerland",
      "period": {
        "start": "Nov 2022",
        "end": "Jun 2024"
      },
      "achievements": [
        "Delivered three key features for SonarCloud's project section in React, integrating with RESTful APIs to enhance data retrieval and improve Clean Code Taxonomy integration and user education on coding best practices.",
        "Pioneered CaYC team's adoption of 8 critical features, using React and TypeScript, streamlining workflow efficiency and cross-team collaboration.",
        "Migrated SonarCloud's issues screen to MIUI using React, receiving positive feedback from senior leadership for improving the daily workflow of developers."
      ],
      "techStack": ["React", "TypeScript", "TailwindCSS", "Git", "AWS"]
    },
    {
      "title": "Senior Full Stack Developer",
      "company": "Equip",
      "location": "Switzerland",
      "period": {
        "start": "Jun 2021",
        "end": "Nov 2022"
      },
      "achievements": [
        "Enhanced Equip app's map search and rental processes, using Svelte and TypeScript, reducing prototype development time by 3 months.",
        "Released the Equip app on Play Store and Apple Store, expanding the company's reach in three countries.",
        "Refactored the Equip app's codebase using React Native and TypeScript, reducing the time to iterate on new features."
      ],
      "techStack": ["Meteor.js", "Svelte", "MongoDB", "Git", "AWS", "Cordova"]
    },
    {
      "title": "Senior Front-end Developer",
      "company": "Scout24",
      "location": "Switzerland",
      "period": {
        "start": "Feb 2020",
        "end": "Sep 2021"
      },
      "achievements": [
        "Enhanced and refactored Anibis Messenger using React and TypeScript, getting positive reactions from management.",
        "Migrated messaging services from Twilio to Sendbird, ensuring full adoption by 100% of users in the first month.",
        "Acted as a Scrum Master for the team, leading daily standups and sprint planning sessions, improving team collaboration and productivity."
      ],
      "techStack": ["React", "Redux", "TypeScript", "Git", "AWS"]
    },
    {
      "title": "Senior Front-end Developer",
      "company": "Integer Consulting",
      "location": "Portugal",
      "period": {
        "start": "Feb 2018",
        "end": "Jan 2020"
      },
      "achievements": [
        "Collaborated on new features for the SkyQ application (British Sky Broadcasting), using React and Redux, improving load times on old TVs from 20 to 1 second.",
        "Authored and deployed key features for SkyQ on PlayStation 4, expanding product reach via successful store releases.",
        "Crafted an internal tool in Python to process security camera logs, enhancing data analysis and security monitoring."
      ],
      "techStack": [
        "React",
        "Redux",
        "PostgreSQL",
        "TypeScript",
        "Git",
        "Python"
      ]
    },
    {
      "title": "Front-end Developer",
      "company": "DataRisk",
      "location": "Brazil",
      "isPrevious": true,
      "period": {
        "start": "Jan 2017",
        "end": "Feb 2018"
      },
      "achievements": [
        "Researched and started the company's main front end application from scratch using React and Redux, starting the company's business idea and vision, and making the company's first product available for beta testing by two customers.",
        "Played a crucial role as the first front-end developer, collaborating closely with a designer to launch the application into beta testing, a significant milestone for the company's growth."
      ],
      "techStack": ["JavaScript", "React", "Redux", "Git"]
    },
    {
      "title": "Front-end Developer",
      "company": "Resultados Digitais",
      "location": "Brazil",
      "isPrevious": true,
      "period": {
        "start": "Apr 2016",
        "end": "Dec 2016"
      },
      "achievements": [
        "Conceived important features in JavaScript and jQuery for the Landing Pages squad, ensuring quality and customer support.",
        "Integrated the effort to migrate the landing pages editor to a WYSIWYG editor, improving the user experience while creating landing pages.",
        "Collaborated with decisions and actions for the front end chapter of the company, always ensuring the front end development had a bright future ahead."
      ],
      "techStack": [
        "JavaScript",
        "jQuery",
        "Ruby on Rails",
        "Git",
        "Heroku"
      ]
    },
    {
      "title": "Front-end Developer",
      "company": "Kanoah",
      "location": "Brazil",
      "isPrevious": true,
      "period": {
        "start": "Jun 2015",
        "end": "Dec 2015"
      },
      "achievements": [
        "Implemented features for a JIRA plugin for testing management using Angular.js, giving the company the first international customers.",
        "Led the front end development of the core feature of testing suites, allowing the company to outperform competitors."
      ],
      "techStack": ["JavaScript", "Angular.js", "Git"]
    },
    {
      "title": "Full Stack Developer",
      "company": "Softplan",
      "location": "Brazil",
      "isPrevious": true,
      "period": {
        "start": "Mar 2014",
        "end": "Jun 2015"
      },
      "achievements": [
        "Engineered critical features for a Java-based file processing tool, directly enhancing data analysis capabilities and boosting the company's reputation in financial software.",
        "Created and optimized queries on PostgreSQL database for fast data querying.",
        "Pioneered on JavaScript and CSS rich interfaces, giving users a more intuitive and user-friendly experience."
      ],
      "techStack": ["Java", "JavaScript", "SQL"]
    }
  ],
  "certifications": [
    {
      "degree": "AWS Certified Cloud Practitioner",
      "institution": "Amazon Web Services",
      "year": "Oct 2023",
      "location": "Switzerland"
    }
  ],
  "education": [
    {
      "degree": "Diploma in Software Engineering and Development",
      "institution": "Faculdade Unilagos",
      "year": "Dec 2011",
      "location": "Brazil"
    }
  ],
  "languages": [
    {
      "name": "English",
      "level": "Full Professional"
    },
    {
      "name": "French",
      "level": "Limited Working"
    },
    {
      "name": "Portuguese",
      "level": "Native"
    }
  ]
}
