{
  "name": "Andrey Luiz",
  "title": "Ingénieur Logiciel Lead",
  "contactInfo": {
    "email": "andreyluiz.developer@gmail.com",
    "phone": "+41 76 503 86 65",
    "location": "Fribourg, Suisse",
    "github": "github.com/andreyluiz",
    "linkedin": "linkedin.com/in/andreyluiz",
    "website": "andreyluiz.com"
  },
  "summary": "Ingénieur Logiciel Lead avec plus de 14 ans d'expérience en développement logiciel, principalement axé sur la qualité et la valeur pour le client. Expérience dans les secteurs SaaS, Web3 et Sport, travaillant toujours en étroite collaboration avec les Product Owners avec une vision innovante et axée sur les résultats. À la recherche d'un poste d'Ingénieur Logiciel Principal ou d'Ingénieur Logiciel Senior, pour mettre à profit l'expertise en développement logiciel et en leadership afin de stimuler les résultats de l'équipe et la valeur du produit.",
  "generalSkills": [
    "Développer des applications full-stack évolutives et maintenables",
    "Collaborer au sein d'équipes Agile interfonctionnelles",
    "Encadrer et guider les développeurs juniors",
    "Piloter les indicateurs clés de performance (KPI) pour mesurer le succès"
  ],
  "skills": [
    {
      "domain": "Frontend",
      "skills": ["React", "TailwindCSS", "TypeScript", "Redux", "Phaser.js"]
    },
    {
      "domain": "Mobile",
      "skills": [
        "React Native",
        "Expo",
        "iOS",
        "Android",
        "Apple Store",
        "Google Play"
      ]
    },
    {
      "domain": "Full-Stack & Bases de Données",
      "skills": [
        "Python",
        "FastAPI",
        "Flask",
        "Node.js",
        "Next.js",
        "SvelteKit",
        "Java",
        "MongoDB",
        "PostgreSQL"
      ]
    },
    {
      "domain": "Outils IA",
      "skills": [
        "Cursor",
        "Cline",
        "Gemini CLI",
        "Claude",
        "Gemini",
        "OpenAI",
        "ChatGPT"
      ]
    },
    {
      "domain": "Outils & Plateformes",
      "skills": ["Git", "AWS", "CI/CD", "Docker", "Supabase"]
    }
  ],
  "experience": [
    {
      "title": "Ingénieur Full Stack",
      "company": "Timeleap",
      "location": "Suisse",
      "period": {
        "start": "Juil 2024",
        "end": "Jan 2025"
      },
      "achievements": [
        "Développé des projets Web3 avec SvelteKit, intégrant divers blockchains et smart contracts.",
        "Implémenté une application portefeuille React Native pour un grand client indien, intégrant une blockchain personnalisée et sécurisant les premiers investissements.",
        "Créé un jeu avec Phaser.js pour un portail de staking, recevant des retours positifs du client et 600 joueurs le premier mois.",
        "Encadré des développeurs juniors, promouvant les bonnes pratiques et la qualité du code, améliorant la productivité et la maintenabilité."
      ]
    },
    {
      "title": "Développeur Front-end Senior",
      "company": "Sonar",
      "location": "Suisse",
      "period": {
        "start": "Nov 2022",
        "end": "Juin 2024"
      },
      "achievements": [
        "Livré de nombreuses fonctionnalités critiques pour la section projet de SonarCloud en React, améliorant l'intégration Clean Code Taxonomy et l'éducation des utilisateurs.",
        "Migré l'écran des problèmes de SonarCloud vers MIUI avec React, recevant des retours positifs de la direction pour l'amélioration du flux de travail.",
        "Pionnier dans l'adoption de plus de 10 fonctionnalités critiques par l'équipe CaYC, utilisant React et TypeScript, assurant l'éducation des utilisateurs et une configuration correcte du projet en moins de 4 mois.",
        "Fourniture de tests complets pour chaque fonctionnalité, améliorant la fiabilité du code et la confiance lors des déploiements, atteignant près de 90% de couverture.",
        "Favorisé l'autonomie de l'équipe dans une hiérarchie horizontale, encourageant la collaboration et l'innovation, et améliorant la dynamique d'équipe."
      ]
    },
    {
      "title": "Développeur Full Stack Senior",
      "company": "Equip",
      "location": "Suisse",
      "period": {
        "start": "Sep 2021",
        "end": "Nov 2022"
      },
      "achievements": [
        "Dirigé le développement du prototype de l'application Equip avec Svelte et Meteor.js, améliorant la fiabilité et la performance, réduisant le temps de développement de 3 mois.",
        "Amélioré la recherche cartographique et les processus de location de l'application Equip, assurant la fiabilité et obtenant les premiers utilisateurs tests.",
        "Publié l'application Equip sur Play Store et Apple Store, élargissant la portée de l'entreprise dans trois pays.",
        "Refondu le code de l'application Equip avec React Native et TypeScript, réduisant le temps d'itération sur les nouvelles fonctionnalités.",
        "Défini les meilleures pratiques et l'architecture de l'application Equip, assurant la qualité et la maintenabilité du code.",
        "Collaboré étroitement avec le Product Owner pour répondre aux besoins des utilisateurs et aux objectifs commerciaux, augmentant la valeur produit et la satisfaction utilisateur."
      ]
    },
    {
      "title": "Développeur Front-end Senior",
      "company": "Scout24",
      "location": "Suisse",
      "period": {
        "start": "Fév 2020",
        "end": "Sep 2021"
      },
      "achievements": [
        "Amélioré et refondu Anibis Messenger avec React et TypeScript, recevant des réactions positives de la direction.",
        "Migré les services de messagerie de Twilio à Sendbird, assurant une adoption complète par 100% des utilisateurs dès le premier mois.",
        "Agit en tant que Scrum Master, dirigeant les réunions quotidiennes et la planification des sprints, améliorant la collaboration et la productivité de l'équipe."
      ]
    },
    {
      "title": "Développeur Front-end Senior",
      "company": "Integer Consulting",
      "location": "Portugal",
      "period": {
        "start": "Fév 2018",
        "end": "Jan 2020"
      },
      "achievements": [
        "Conçu de nouvelles fonctionnalités pour l'application SkyQ (British Sky Broadcasting) avec React et Redux, améliorant les temps de chargement sur les anciennes TV de 20 à 1 seconde.",
        "Développé et déployé des fonctionnalités critiques pour SkyQ sur PlayStation 4, élargissant la portée du produit et la satisfaction utilisateur.",
        "Créé un outil interne en Python pour traiter les logs de caméras de sécurité, améliorant l'analyse des données et la surveillance."
      ]
    },
    {
      "title": "Développeur Front-end",
      "company": "DataRisk",
      "location": "Brésil",
      "isPrevious": true,
      "period": {
        "start": "Jan 2017",
        "end": "Fév 2018"
      },
      "achievements": [
        "Recherche et démarrage de l'application frontale principale de l'entreprise à partir de zéro avec React et Redux, lançant l'idée et la vision de l'entreprise.",
        "Collaboration avec les développeurs back-end pour créer une application fiable, rendant le premier produit disponible pour des tests bêta par deux clients.",
        "Joué un rôle clé en tant que premier développeur front-end, collaborant étroitement avec un designer pour élargir les tests bêta, une étape importante pour la croissance de l'entreprise."
      ]
    },
    {
      "title": "Développeur Front-end",
      "company": "Resultados Digitais",
      "location": "Brésil",
      "isPrevious": true,
      "period": {
        "start": "Avr 2016",
        "end": "Déc 2016"
      },
      "achievements": [
        "Conçu des fonctionnalités importantes en JavaScript et jQuery pour l'équipe Landing Pages, assurant la qualité et le support client.",
        "Participé à la migration de l'éditeur de pages d'atterrissage vers un éditeur WYSIWYG, améliorant l'expérience utilisateur.",
        "Contribué aux décisions et actions pour le chapitre front-end de l'entreprise, assurant un avenir prometteur au développement front-end."
      ]
    },
    {
      "title": "Développeur Front-end",
      "company": "Kanoah",
      "location": "Brésil",
      "isPrevious": true,
      "period": {
        "start": "Juin 2015",
        "end": "Déc 2015"
      },
      "achievements": [
        "Implémenté des fonctionnalités pour un plugin JIRA de gestion de tests avec Angular.js, obtenant les premiers clients internationaux.",
        "Dirigé le développement front-end de la fonctionnalité principale de gestion de tests, permettant à l'entreprise de surpasser ses concurrents."
      ]
    },
    {
      "title": "Développeur Full Stack",
      "company": "Softplan",
      "location": "Brésil",
      "isPrevious": true,
      "period": {
        "start": "Mar 2014",
        "end": "Juin 2015"
      },
      "achievements": [
        "Conçu des fonctionnalités critiques pour un outil de traitement de fichiers basé sur Java, améliorant directement les capacités d'analyse de données et la réputation de l'entreprise dans les logiciels financiers.",
        "Créé et optimisé des requêtes sur la base de données PostgreSQL pour des recherches rapides.",
        "Innové sur des interfaces riches en JavaScript et CSS, offrant aux utilisateurs une expérience plus intuitive et conviviale."
      ]
    }
  ],
  "certifications": [
    {
      "degree": "AWS Certified Cloud Practitioner",
      "institution": "Amazon Web Services",
      "year": "Oct 2023",
      "location": "Suisse"
    }
  ],
  "education": [
    {
      "degree": "Licence en Ingénierie et Développement Logiciel",
      "institution": "Université Unilagos",
      "year": "Déc 2011",
      "location": "Brésil",
      "topics": "Mathématiques appliquées, Algorithmes, Apprentissage automatique, Calcul distribué, Développement logiciel, Développement web, Gestion de bases de données, Gestion de projet, UML"
    }
  ],
  "languages": [
    {
      "name": "Anglais",
      "level": "Professionnel complet"
    },
    {
      "name": "Français",
      "level": "Compétence professionnelle limitée"
    },
    {
      "name": "Portugais",
      "level": "Natif"
    }
  ],
  "personalityTraits": [
    "Ambitieux",
    "Calme",
    "Concentré",
    "Fiable",
    "Apprend vite",
    "Orienté solution",
    "Respectueux",
    "Responsable",
    "Communicatif"
  ]
}