{
  "name": "Andrey Luiz",
  "title": "Ingénieur Full Stack Senior",
  "contactInfo": {
    "email": "andreyluiz.developer@gmail.com",
    "phone": "+41 76 503 86 65",
    "location": "Fribourg, Suisse",
    "website": "andreyluiz.com",
    "linkedin": "linkedin.com/in/andreyluiz"
  },
  "summary": "Ingénieur full stack avec plus de 12 ans d'expérience, spécialisé dans les frameworks JavaScript, TypeScript, Next.js, Python et AWS. A travaillé sur des applications pour Smart TVs et PS4, du développement avec React jusqu'à l'approbation et le lancement. A amélioré l'expérience utilisateur et stimulé la croissance des entreprises dans des sociétés suisses réputées comme SonarSource et Scout24. A développé des applications prêtes pour la production avec React Native et lancé sur Google Play et Apple Store, élargissant la portée de l'entreprise dans différents pays.",
  "skills": [
    {
      "domain": "Frontend",
      "skills": ["React", "SvelteKit", "Next.js", "Phaser", "TailwindCSS"]
    },
    { "domain": "Backend", "skills": ["Node.js", "Python"] },
    { "domain": "Bases de données", "skills": ["PostgreSQL", "MongoDB"] },
    { "domain": "DevOps & Cloud", "skills": ["AWS", "Git", "CI/CD"] }
  ],
  "experience": [
    {
      "title": "Ingénieur Frontend",
      "company": "Sonar",
      "location": "Suisse",
      "period": {
        "start": "Novembre 2022",
        "end": "Juin 2024"
      },
      "achievements": [
        "A livré trois fonctionnalités clés pour la section projet de SonarCloud en React, intégrant des APIs RESTful pour améliorer la récupération des données et optimiser l'intégration de la Taxonomie du Code Propre et l'éducation des utilisateurs sur les meilleures pratiques de codage.",
        "A été pionnier dans l'adoption de 8 fonctionnalités critiques par l'équipe CaYC, optimisant l'efficacité du flux de travail et la collaboration inter-équipes.",
        "A migré l'écran des problèmes de SonarCloud vers MIUI en utilisant React, recevant des retours positifs de la direction senior pour l'amélioration du flux de travail quotidien des développeurs."
      ],
      "techStack": ["React", "TypeScript", "TailwindCSS", "Git", "AWS"]
    },
    {
      "title": "Ingénieur Full Stack",
      "company": "Equip",
      "location": "Suisse",
      "period": {
        "start": "Juin 2021",
        "end": "Novembre 2022"
      },
      "achievements": [
        "A amélioré la recherche sur carte et les processus de location de l'application Equip, réduisant le temps de développement du prototype de 3 mois.",
        "A optimisé les capacités Bluetooth de l'application hybride pour la connexion avec les stations de location, augmentant la fiabilité de 20% à 100%.",
        "A lancé l'application Equip sur Play Store et Apple Store, élargissant la portée de l'entreprise dans trois pays."
      ],
      "techStack": ["Meteor.js", "Svelte", "MongoDB", "Git", "AWS", "Cordova"]
    },
    {
      "title": "Ingénieur Frontend",
      "company": "Scout24 Schweiz AG",
      "location": "Suisse",
      "period": {
        "start": "Février 2020",
        "end": "Septembre 2021"
      },
      "achievements": [
        "A amélioré et refactorisé Anibis Messenger en utilisant React et TypeScript, obtenant des réactions positives de la direction.",
        "A migré les services de messagerie de Twilio vers Sendbird, assurant une adoption complète par 100% des utilisateurs dès le premier mois."
      ],
      "techStack": ["React", "Redux", "TypeScript", "Git", "AWS"]
    },
    {
      "title": "Ingénieur Full Stack",
      "company": "Integer Consulting",
      "location": "Portugal",
      "period": {
        "start": "Février 2018",
        "end": "Janvier 2020"
      },
      "achievements": [
        "A développé de nouvelles fonctionnalités pour l'application SkyQ (British Sky Broadcasting), utilisant Redux pour la gestion d'état et le stockage local pour optimiser les performances, améliorant l'expérience utilisateur et la disponibilité dans tous les pays où le produit était présent.",
        "A créé et déployé des fonctionnalités clés pour SkyQ sur PlayStation 4, élargissant la portée du produit grâce à des lancements réussis sur le store."
      ],
      "techStack": [
        "React",
        "Redux",
        "PostgreSQL",
        "TypeScript",
        "Git",
        "Python"
      ]
    },
    {
      "title": "Ingénieur Frontend",
      "company": "DataRisk",
      "location": "Brésil",
      "period": {
        "start": "Janvier 2017",
        "end": "Février 2018"
      },
      "achievements": [
        "A dirigé le développement initial de l'application frontend de DataRisk en utilisant React et Redux, permettant aux trois premiers clients de tester le nouveau produit innovant de machine learning.",
        "A dirigé le développement frontend, collaborant avec les designers pour lancer le premier produit bêta de l'entreprise, sécurisant les premiers clients."
      ],
      "techStack": ["React", "Redux", "JavaScript", "Git"]
    },
    {
      "title": "Ingénieur Frontend",
      "company": "Resultados Digitais",
      "location": "Brésil",
      "period": {
        "start": "Avril 2016",
        "end": "Décembre 2016"
      },
      "achievements": [
        "A introduit des fonctionnalités clés en JavaScript et jQuery pour l'équipe Landing Pages, améliorant la qualité du produit et l'expérience client.",
        "A migré l'éditeur de landing pages vers une interface WYSIWYG, améliorant l'ergonomie et la flexibilité du design, et recevant des retours positifs des clients dès les premières semaines de lancement."
      ],
      "techStack": ["JavaScript", "jQuery", "Git"]
    },
    {
      "title": "Développeur Frontend",
      "company": "Kanoah",
      "location": "Brésil",
      "period": {
        "start": "Juin 2015",
        "end": "Décembre 2015"
      },
      "achievements": [
        "A développé des fonctionnalités pour un plugin de gestion de tests JIRA en utilisant Angular.js, aidant Kanoah à sécuriser ses premiers clients internationaux.",
        "A dirigé le développement frontend pour les suites de tests, améliorant la compétitivité de Kanoah sur le marché."
      ],
      "techStack": ["Angular.js", "JavaScript", "Git"]
    }
  ],
  "breaks": [
    {
      "period": {
        "start": "Juillet 2024",
        "end": "Présent"
      },
      "achievements": [
        "Gérer une transition familiale et déménager dans un autre canton pour explorer de nouvelles opportunités.",
        "Approfondir l'expertise en Rust, Python et .NET pour guider les décisions futures de carrière.",
        "Construire des projets personnels full-stack incluant andreyluiz.com, cv.andreyluiz.com et d'autres, pour maintenir les compétences à jour.",
        "Étudier comment l'IA façonne l'avenir du développement logiciel, appliqué aux ingénieurs seniors.",
        "Commencer la recherche d'emploi en janvier 2025 en cherchant des opportunités impactantes à long terme."
      ]
    }
  ],
  "certifications": [
    {
      "degree": "AWS Certified Cloud Practitioner",
      "institution": "Amazon Web Services",
      "year": "Octobre 2023",
      "location": "Suisse"
    }
  ],
  "education": [
    {
      "degree": "Diplôme en Ingénierie et Développement de Logiciels",
      "institution": "Faculdade Unilagos",
      "year": "Décembre 2011",
      "location": "Brésil"
    }
  ],
  "languages": [
    {
      "name": "Anglais",
      "level": "Professionnel Complet"
    },
    {
      "name": "Français",
      "level": "Connaissance Limitée"
    },
    {
      "name": "Portugais",
      "level": "Natif"
    }
  ]
}

