{
  "name": "Andrey Luiz",
  "title": "Engenheiro de Software Sênior",
  "contactInfo": {
    "email": "andreyluiz.developer@gmail.com",
    "phone": "+41 76 503 86 65",
    "location": "Route de la Gruyère 21, 1700 Fribourg, Suíça",
    "github": "github.com/andreyluiz",
    "linkedin": "linkedin.com/in/andreyluiz",
    "website": "andreyluiz.com",
    "age": "33 anos",
    "nationality": "Brasileiro, Permisso B"
  },
  "summary": "Engenheiro com mais de 14 anos de experiência em desenvolvimento de software, focado principalmente em qualidade e valor para o cliente. Eu trabalhei em SaaS, Web3 e Esportes, sempre próximo a Product Owners com uma visão inovadora e orientada ao cliente para impulsionar resultados da equipe e valor do produto.",
  "qualities": [
    "Ambicioso",
    "Orientado a solução",
    "Fiável",
    "Responsável",
    "Focado"
  ],
  "generalSkills": [
    "Desenvolver aplicações full-stack escaláveis e de fácil manutenção",
    "Colaborar em equipes ágeis multifuncionais",
    "Mentorar e orientar desenvolvedores juniores",
    "Gerenciar métricas e indicadores-chave de desempenho (KPIs) para medir o sucesso"
  ],
  "skills": [
    {
      "domain": "Frontend",
      "skills": ["React", "TailwindCSS", "TypeScript", "Redux", "Phaser.js"]
    },
    {
      "domain": "Mobile",
      "skills": [
        "React Native",
        "Expo",
        "iOS",
        "Android",
        "Apple Store",
        "Google Play"
      ]
    },
    {
      "domain": "Full-Stack & Bancos de Dados",
      "skills": [
        "Python",
        "FastAPI",
        "Flask",
        "Node.js",
        "Next.js",
        "SvelteKit",
        "Java",
        "MongoDB",
        "PostgreSQL"
      ]
    },
    {
      "domain": "Ferramentas de IA",
      "skills": [
        "Cursor",
        "Cline",
        "Gemini CLI",
        "Claude",
        "Gemini",
        "OpenAI",
        "ChatGPT"
      ]
    },
    {
      "domain": "Ferramentas & Plataformas",
      "skills": ["Git", "AWS", "CI/CD", "Docker", "Supabase"]
    }
  ],
  "experience": [
    {
      "title": "Engenheiro Full Stack",
      "company": "Timeleap",
      "location": "Suíça",
      "period": {
        "start": "2024",
        "end": "2025"
      },
      "achievements": [
        "Desenvolveu projetos Web3 usando SvelteKit, integrando com diversos blockchains e smart contracts.",
        "Implementou um aplicativo de carteira em React Native para um grande cliente da Índia, integrando com uma blockchain personalizada e garantindo os primeiros investimentos.",
        "Criou um jogo usando Phaser.js para um portal de staking, recebendo feedback positivo do cliente e alcançando 600 jogadores no primeiro mês."
      ]
    },
    {
      "title": "Desenvolvedor Front-end Sênior",
      "company": "Sonar",
      "location": "Suíça",
      "period": {
        "start": "2022",
        "end": "2024"
      },
      "achievements": [
        "Entregou diversas funcionalidades críticas para a seção de projetos do SonarCloud em React, melhorando a integração do Clean Code Taxonomy e a educação dos usuários.",
        "Pioneirou a adoção de mais de 10 funcionalidades críticas pela equipe CaYC, usando React e TypeScript, garantindo a educação dos usuários e a configuração adequada do projeto em menos de 4 meses.",
        "Entregou testes completos para cada funcionalidade, melhorando a confiabilidade do código e a confiança nos deploys, elevando a cobertura para quase 90%.",
        "Promoveu a autonomia da equipe em uma hierarquia horizontal, incentivando a colaboração e inovação, e melhorando a dinâmica do time."
      ]
    },
    {
      "title": "Desenvolvedor Full Stack Sênior",
      "company": "Equip",
      "location": "Suíça",
      "period": {
        "start": "2021",
        "end": "2022"
      },
      "achievements": [
        "Liderou o desenvolvimento do protótipo do app Equip usando Svelte e Meteor.js, melhorando a confiabilidade e performance, reduzindo o tempo de desenvolvimento em 3 meses.",
        "Aprimorou a busca no mapa e processos de aluguel do app Equip, garantindo confiabilidade e conquistando os primeiros usuários de teste.",
        "Lançou o app Equip na Play Store e Apple Store, expandindo o alcance da empresa em três países.",
        "Refatorou o código do app Equip usando React Native e TypeScript, reduzindo o tempo de iteração em novas funcionalidades.",
        "Colaborou de perto com o Product Owner para garantir que o produto atendesse às necessidades dos usuários e objetivos do negócio, aumentando o valor do produto e a satisfação do usuário."
      ]
    },
    {
      "title": "Desenvolvedor Front-end Sênior",
      "company": "Scout24",
      "location": "Suíça",
      "period": {
        "start": "2020",
        "end": "2021"
      },
      "achievements": [
        "Aprimorou e refatorou o Anibis Messenger usando React e TypeScript, recebendo reações positivas da gerência.",
        "Migrou os serviços de mensagens do Twilio para Sendbird, garantindo adoção total por 100% dos usuários no primeiro mês.",
        "Atuou como Scrum Master, liderando reuniões diárias e planejamento de sprints, melhorando a colaboração e produtividade da equipe."
      ]
    },
    {
      "title": "Desenvolvedor Front-end Sênior",
      "company": "Integer Consulting",
      "location": "Portugal",
      "isPrevious": true,
      "period": {
        "start": "2018",
        "end": "2020"
      },
      "achievements": [
        "Formulou novas funcionalidades para o aplicativo SkyQ (British Sky Broadcasting) usando React e Redux, melhorando o tempo de carregamento em TVs antigas de 20 para 1 segundo.",
        "Desenvolveu e lançou funcionalidades críticas para o SkyQ no PlayStation 4, expandindo o alcance do produto e a satisfação dos usuários.",
        "Criou uma ferramenta interna em Python para processar logs de câmeras de segurança, aprimorando a análise de dados e o monitoramento."
      ]
    },
    {
      "title": "Desenvolvedor Front-end",
      "company": "DataRisk",
      "location": "Brasil",
      "isPrevious": true,
      "period": {
        "start": "2017",
        "end": "2018"
      },
      "achievements": [
        "Pesquisou e iniciou o principal aplicativo front-end da empresa do zero usando React e Redux, impulsionando a ideia e visão do negócio.",
        "Colaborou com desenvolvedores back-end para criar um aplicativo confiável, tornando o primeiro produto disponível para testes beta por dois clientes.",
        "Teve papel fundamental como primeiro desenvolvedor front-end, colaborando de perto com um designer para expandir os testes beta, um marco importante para o crescimento da empresa."
      ]
    },
    {
      "title": "Desenvolvedor Front-end",
      "company": "Resultados Digitais",
      "location": "Brasil",
      "isPrevious": true,
      "period": {
        "start": "2016",
        "end": "2016"
      },
      "achievements": [
        "Concebeu funcionalidades importantes em JavaScript e jQuery para o time de Landing Pages, garantindo qualidade e suporte ao cliente.",
        "Participou da migração do editor de landing pages para um editor WYSIWYG, melhorando a experiência do usuário.",
        "Colaborou em decisões e ações para o capítulo front-end da empresa, sempre garantindo um futuro promissor para o desenvolvimento front-end."
      ]
    },
    {
      "title": "Desenvolvedor Front-end",
      "company": "Kanoah",
      "location": "Brasil",
      "isPrevious": true,
      "period": {
        "start": "2015",
        "end": "2015"
      },
      "achievements": [
        "Implementou funcionalidades para um plugin JIRA de gestão de testes usando Angular.js, conquistando os primeiros clientes internacionais.",
        "Liderou o desenvolvimento front-end da principal funcionalidade de gestão de testes, permitindo à empresa superar concorrentes."
      ]
    },
    {
      "title": "Desenvolvedor Full Stack",
      "company": "Softplan",
      "location": "Brasil",
      "isPrevious": true,
      "isHidden": true,
      "period": {
        "start": "2014",
        "end": "2015"
      },
      "achievements": [
        "Engenhou funcionalidades críticas para uma ferramenta de processamento de arquivos baseada em Java, melhorando diretamente a análise de dados e a reputação da empresa em software financeiro.",
        "Criou e otimizou queries no banco de dados PostgreSQL para consultas rápidas.",
        "Inovou em interfaces ricas em JavaScript e CSS, proporcionando aos usuários uma experiência mais intuitiva e amigável."
      ]
    }
  ],
  "certifications": [
    {
      "degree": "AWS Certified Cloud Practitioner",
      "institution": "Amazon Web Services",
      "year": "2023",
      "location": "Suíça"
    }
  ],
  "education": [
    {
      "degree": "Bacharel em Engenharia e Desenvolvimento de Software",
      "institution": "Universidade Unilagos",
      "year": "2011",
      "location": "Brasil",
      "topics": "Matemática Aplicada, Algoritmos, Aprendizado de Máquina, Computação Distribuída, Desenvolvimento de Software, Desenvolvimento Web, Gerenciamento de Banco de Dados, Gerenciamento de Projetos, UML"
    }
  ],
  "languages": [
    {
      "name": "Inglês",
      "level": "C2"
    },
    {
      "name": "Francês",
      "level": "B2"
    },
    {
      "name": "Português",
      "level": "C2"
    }
  ],
  "personalityTraits": [
    "Ambicioso",
    "Calmo",
    "Focado",
    "Confiável",
    "Aprendiz rápido",
    "Orientado a soluções",
    "Respeitoso",
    "Responsável",
    "Comunicativo"
  ]
}
