{
  "name": "Andrey Luiz",
  "title": "Desenvolvedor Front-end Sênior",
  "contactInfo": {
    "email": "andreyluiz.developer@gmail.com",
    "phone": "+41 76 503 86 65",
    "location": "Fribourg, Suíça",
    "website": "andreyluiz.com",
    "linkedin": "linkedin.com/in/andreyluiz"
  },
  "summary": "Desenvolvedor frontend com mais de 12 anos de experiência, especializado em frameworks JavaScript, TypeScript, React e tecnologias frontend modernas. Especialista em desenvolvimento web e mobile, com ampla experiência em React Native para aplicações multiplataforma. Trabalhou em aplicativos para Smart TVs e PS4, desde o desenvolvimento com React até aprovação e lançamento. Melhorou a experiência do usuário e impulsionou o crescimento dos negócios em empresas suíças respeitáveis como SonarSource e Scout24. Desenvolveu e lançou com sucesso múltiplas aplicações React Native na Google Play e Apple Store, expandindo o alcance da empresa em diferentes países.",
  "skills": [
    {
      "domain": "Frontend",
      "skills": ["React", "TailwindCSS", "TypeScript", "Redux", "Phaser.js"]
    },
    {
      "domain": "Mobile",
      "skills": [
        "React Native",
        "Expo",
        "iOS",
        "Android",
        "Apple Store",
        "Google Play"
      ]
    },
    {
      "domain": "Full-Stack & Bancos de Dados",
      "skills": ["Node.js", "Next.js", "SvelteKit", "MongoDB", "PostgreSQL"]
    },
    {
      "domain": "Ferramentas & Plataformas",
      "skills": ["Git", "AWS", "CI/CD", "Docker", "Supabase"]
    }
  ],
  "experience": [
    {
      "title": "Desenvolvedor Front-end Senior",
      "company": "Sonar",
      "location": "Suíça",
      "period": {
        "start": "Novembro 2022",
        "end": "Junho 2024"
      },
      "achievements": [
        "Entregou três funcionalidades principais para a seção de projetos do SonarCloud em React, integrando com APIs RESTful para melhorar a recuperação de dados e aprimorar a integração da Taxonomia de Código Limpo e educação do usuário sobre melhores práticas de codificação.",
        "Pioneirou a adoção de 8 funcionalidades críticas pela equipe CaYC, otimizando a eficiência do fluxo de trabalho e colaboração entre equipes.",
        "Migrou a tela de problemas do SonarCloud para MIUI usando React, recebendo feedback positivo da liderança sênior por melhorar o fluxo de trabalho diário dos desenvolvedores."
      ],
      "techStack": ["React", "TypeScript", "TailwindCSS", "Git", "AWS"]
    },
    {
      "title": "Desenvolvedor Full Stack Senior",
      "company": "Equip",
      "location": "Suíça",
      "period": {
        "start": "Junho 2021",
        "end": "Novembro 2022"
      },
      "achievements": [
        "Aprimorou a busca no mapa e processos de aluguel do aplicativo Equip, reduzindo o tempo de desenvolvimento do protótipo em 3 meses.",
        "Otimizou as capacidades Bluetooth do aplicativo híbrido para conexão com estações de aluguel, aumentando a confiabilidade de 20% para 100%.",
        "Lançou o aplicativo Equip na Play Store e Apple Store, expandindo o alcance da empresa em três países."
      ],
      "techStack": ["Meteor.js", "Svelte", "MongoDB", "Git", "AWS", "Cordova"]
    },
    {
      "title": "Desenvolvedor Front-end Senior",
      "company": "Scout24 Schweiz AG",
      "location": "Suíça",
      "period": {
        "start": "Fevereiro 2020",
        "end": "Setembro 2021"
      },
      "achievements": [
        "Aprimorou e refatorou o Anibis Messenger usando React e TypeScript, obtendo reações positivas da gerência.",
        "Migrou serviços de mensagens do Twilio para Sendbird, garantindo adoção completa por 100% dos usuários no primeiro mês."
      ],
      "techStack": ["React", "Redux", "TypeScript", "Git", "AWS"]
    },
    {
      "title": "Desenvolvedor Full Stack Senior",
      "company": "Integer Consulting",
      "location": "Portugal",
      "period": {
        "start": "Fevereiro 2018",
        "end": "Janeiro 2020"
      },
      "achievements": [
        "Desenvolveu novas funcionalidades para o aplicativo SkyQ (British Sky Broadcasting), utilizando Redux para gerenciamento de estado e armazenamento local para performance otimizada, melhorando a experiência do usuário e disponibilidade em todos os países onde o produto estava presente.",
        "Criou e implantou funcionalidades-chave para SkyQ no PlayStation 4, expandindo o alcance do produto através de lançamentos bem-sucedidos na loja."
      ],
      "techStack": [
        "React",
        "Redux",
        "PostgreSQL",
        "TypeScript",
        "Git",
        "Python"
      ]
    },
    {
      "title": "Desenvolvedor Front-end",
      "company": "Outras empresas",
      "location": "Brasil",
      "period": {
        "start": "Junho 2015",
        "end": "Janeiro 2018"
      },
      "achievements": [
        "Trabalhou em várias startups no Brasil como Desenvolvedor Frontend, como Kanoah, DataRisk e Resultados Digitais.",
        "Liderou funcionalidades importantes para o Kanoah Test Manager, um plugin JIRA para gerenciamento de testes, hoje parte da Adaptavist.",
        "Concebeu a primeira versão do editor WYSIWYG de landing pages para o RD Station, na Resultados Digitais.",
        "Desenvolveu do zero o primeiro protótipo da plataforma de machine learning para a DataRisk.",
        "Utilizou tecnologias como React, Redux, JavaScript, Git, Angular.js, jQuery e outras."
      ],
      "techStack": [
        "React",
        "Redux",
        "JavaScript",
        "Git",
        "Angular.js",
        "jQuery"
      ]
    }
  ],
  "breaks": [
    {
      "period": {
        "start": "Julho 2024",
        "end": "Presente"
      },
      "achievements": [
        "Gerenciar uma transição familiar e se mudar para outro cantão para explorar novas oportunidades.",
        "Aprofundar expertise em Rust, Python e .NET para ajudar a orientar futuras decisões de carreira.",
        "Construir projetos pessoais full-stack incluindo andreyluiz.com, cv.andreyluiz.com e outros, para manter as habilidades afiadas.",
        "Estudar como a IA está moldando o futuro do desenvolvimento de software, aplicado a engenheiros seniores.",
        "Iniciar busca por emprego em janeiro de 2025 procurando oportunidades impactantes de longo prazo."
      ]
    }
  ],
  "certifications": [
    {
      "degree": "AWS Certified Cloud Practitioner",
      "institution": "Amazon Web Services",
      "year": "Outubro 2023",
      "location": "Suíça"
    }
  ],
  "education": [
    {
      "degree": "Diploma em Engenharia e Desenvolvimento de Software",
      "institution": "Faculdade Unilagos",
      "year": "Dezembro 2011",
      "location": "Brasil"
    }
  ],
  "languages": [
    {
      "name": "Inglês",
      "level": "Profissional Completo"
    },
    {
      "name": "Francês",
      "level": "Trabalho Limitado"
    },
    {
      "name": "Português",
      "level": "Nativo"
    }
  ]
}
