{
  "name": "Andrey Luiz",
  "title": "Engenheiro Full Stack Sênior",
  "contactInfo": {
    "email": "andreyluiz.developer@gmail.com",
    "phone": "+41 76 503 86 65",
    "location": "Fribourg, Suíça",
    "website": "andreyluiz.com",
    "linkedin": "linkedin.com/in/andreyluiz"
  },
  "summary": "Engenheiro Full Stack Sênior especializado em React, Node.js, TypeScript, AWS e Web3, com paixão por desenvolver aplicações escaláveis e de alto desempenho. Histórico comprovado de entrega de soluções impactantes na Timeleap, SonarSource e Equip, melhorando a experiência do usuário e impulsionando o crescimento do negócio. Experiência na aplicação de ferramentas baseadas em IA para análise automatizada de perfis no Twitter. Certificado AWS, atualmente explorando o ecossistema Rust para aprofundar conhecimentos em backend e expandir versatilidade técnica. Fluente em Português e Inglês, com proficiência profissional em Francês e Alemão.",
  "skills": [
    {
      "domain": "Frontend",
      "skills": ["React", "SvelteKit", "Next.js", "Phaser", "TailwindCSS"]
    },
    { "domain": "Backend", "skills": ["Node.js", "Python", "Rust"] },
    { "domain": "Web3", "skills": ["Solidity", "Ethers.js"] },
    { "domain": "Bancos de Dados", "skills": ["PostgreSQL", "MongoDB"] },
    { "domain": "DevOps & Cloud", "skills": ["AWS", "Git", "CI/CD"] }
  ],
  "experience": [
    {
      "title": "Engenheiro Full Stack",
      "company": "Timeleap",
      "location": "Suíça",
      "period": {
        "start": "Julho 2024",
        "end": "Janeiro 2025"
      },
      "achievements": [
        "Liderou o desenvolvimento de aplicações descentralizadas usando SvelteKit e TypeScript, gerando mais de 50k CHF em receita nos primeiros meses de operação.",
        "Construiu um portal de staking baseado em Phaser, otimizando performance e aumentando o engajamento dos usuários."
      ],
      "techStack": [
        "SvelteKit",
        "TypeScript",
        "MongoDB",
        "PostgreSQL",
        "TailwindCSS",
        "Phaser",
        "AWS"
      ]
    },
    {
      "title": "Engenheiro Frontend",
      "company": "Sonar",
      "location": "Suíça",
      "period": {
        "start": "Novembro 2022",
        "end": "Junho 2024"
      },
      "achievements": [
        "Entregou três funcionalidades principais para a seção de projetos do SonarCloud em React, melhorando a integração da Taxonomia de Código Limpo e a educação dos usuários sobre melhores práticas de programação.",
        "Liderou a adoção de 8 funcionalidades críticas pela equipe CaYC, otimizando a eficiência do fluxo de trabalho e a colaboração entre equipes.",
        "Migrou a tela de issues do SonarCloud para MIUI usando React, melhorando a consistência da UI e a experiência do usuário."
      ],
      "techStack": ["React", "TypeScript", "TailwindCSS", "Git", "AWS"]
    },
    {
      "title": "Engenheiro Full Stack",
      "company": "Equip",
      "location": "Suíça",
      "period": {
        "start": "Junho 2021",
        "end": "Novembro 2022"
      },
      "achievements": [
        "Aprimorou a busca no mapa e os processos de aluguel do aplicativo Equip, reduzindo o tempo de desenvolvimento do protótipo em 3 meses.",
        "Otimizou a conectividade Bluetooth para estações de aluguel, aumentando a confiabilidade de 20% para 100%.",
        "Lançou o aplicativo Equip na Play Store e Apple Store, expandindo o alcance da empresa na Suíça, França e EUA."
      ],
      "techStack": ["Meteor.js", "Svelte", "MongoDB", "Git", "AWS", "Cordova"]
    },
    {
      "title": "Engenheiro Frontend",
      "company": "Scout24 Schweiz AG",
      "location": "Suíça",
      "period": {
        "start": "Fevereiro 2020",
        "end": "Setembro 2021"
      },
      "achievements": [
        "Desenvolveu e aprimorou o Anibis Messenger usando React e TypeScript, continuamente melhorando a experiência do usuário.",
        "Migrou os serviços de mensagens do Twilio para Sendbird, garantindo adoção total por 100% dos usuários no primeiro mês.",
        "Atuou como Scrum Master para o squad Aldrin, impulsionando a produtividade da equipe e a eficiência na comunicação."
      ],
      "techStack": ["React", "Redux", "TypeScript", "Git", "AWS"]
    },
    {
      "title": "Engenheiro Full Stack",
      "company": "Integer Consulting",
      "location": "Portugal",
      "period": {
        "start": "Fevereiro 2018",
        "end": "Janeiro 2020"
      },
      "achievements": [
        "Desenvolveu 3 componentes React para o Adobe Content Manager, aprimorando fluxos de trabalho de conteúdo para empresas de energia na Alemanha e Reino Unido.",
        "Desenvolveu novas funcionalidades para o aplicativo SkyQ (British Sky Broadcasting), melhorando a experiência do usuário e disponibilidade na Alemanha e Áustria.",
        "Projetou e implementou funcionalidades principais para o SkyQ no PlayStation 4, expandindo o alcance do produto através de lançamentos bem-sucedidos na loja."
      ],
      "techStack": [
        "React",
        "Redux",
        "PostgreSQL",
        "TypeScript",
        "Git",
        "Python"
      ]
    },
    {
      "title": "Engenheiro Frontend",
      "company": "DataRisk",
      "location": "Brasil",
      "period": {
        "start": "Janeiro 2017",
        "end": "Fevereiro 2018"
      },
      "achievements": [
        "Construiu a primeira aplicação frontend da DataRisk do zero usando React e Redux, transformando a visão da empresa em um produto funcional.",
        "Liderou o desenvolvimento frontend, colaborando com designers para lançar o primeiro produto beta da empresa, conquistando os primeiros clientes."
      ],
      "techStack": ["React", "Redux", "JavaScript", "Git"]
    },
    {
      "title": "Engenheiro Frontend",
      "company": "Resultados Digitais",
      "location": "Brasil",
      "period": {
        "start": "Abril 2016",
        "end": "Dezembro 2016"
      },
      "achievements": [
        "Desenvolveu funcionalidades principais em JavaScript e jQuery para a equipe de Landing Pages, melhorando a qualidade do produto e a experiência do cliente.",
        "Migrou o editor de landing pages para uma interface WYSIWYG, melhorando a usabilidade e flexibilidade de design."
      ],
      "techStack": ["JavaScript", "jQuery", "Git"]
    },
    {
      "title": "Desenvolvedor Frontend",
      "company": "Kanoah",
      "location": "Brasil",
      "period": {
        "start": "Junho 2015",
        "end": "Dezembro 2015"
      },
      "achievements": [
        "Desenvolveu funcionalidades para um plugin de gerenciamento de testes JIRA usando Angular.js, ajudando a Kanoah a conquistar seus primeiros clientes internacionais.",
        "Liderou o desenvolvimento frontend para suites de teste, melhorando a competitividade da Kanoah no mercado."
      ],
      "techStack": ["Angular.js", "JavaScript", "Git"]
    },
    {
      "title": "Desenvolvedor Full Stack",
      "company": "Softplan Planejamento e Sistemas",
      "location": "Brasil",
      "period": {
        "start": "Março 2014",
        "end": "Junho 2015"
      },
      "achievements": [
        "Desenvolveu funcionalidades principais para uma ferramenta de processamento de arquivos baseada em Java, melhorando capacidades de análise de dados e fortalecendo a reputação da Softplan em software financeiro.",
        "Construiu interfaces interativas em JavaScript e CSS, melhorando a experiência do usuário e usabilidade."
      ],
      "techStack": ["Java", "JSP", "PostgreSQL", "JavaScript", "Git"]
    }
  ],
  "projects": [
    {
      "name": "Tutorial Não Oficial da Biblioteca Iced",
      "description": "Um tutorial para a biblioteca Iced, uma biblioteca Rust para construir interfaces de usuário. Estou migrando o tutorial para a versão mais recente da biblioteca Iced.",
      "techStack": ["Rust", "Iced", "Interfaces de Usuário"],
      "period": {
        "start": "Fevereiro 2025",
        "end": "Presente"
      }
    },
    {
      "name": "Rust UI Labs",
      "description": "Estamos fazendo um esforço para migrar alguns componentes UI comuns para Leptos e Dioxus. Estes componentes são frequentemente usados em aplicações web, mas ninguém tentou portá-los para Rust ainda.",
      "techStack": ["Rust", "Leptos", "Dioxus", "Componentes UI"],
      "period": {
        "start": "Fevereiro 2025",
        "end": "Presente"
      }
    }
  ],
  "certifications": [
    {
      "degree": "AWS Certified Cloud Practitioner",
      "institution": "Amazon Web Services",
      "year": "Outubro 2023",
      "location": "Suíça"
    },
    {
      "degree": "Programação Rust: Dos Fundamentos aos Conceitos Avançados com Desenvolvimento Assistido por IA",
      "institution": "LinkedIn",
      "year": "Março 2025",
      "location": "Suíça"
    }
  ],
  "education": [
    {
      "degree": "Diploma em Engenharia e Desenvolvimento de Software",
      "institution": "Faculdade Unilagos",
      "year": "Dezembro 2011",
      "location": "Brasil"
    }
  ],
  "languages": [
    {
      "name": "Português",
      "level": "Nativo"
    },
    {
      "name": "Inglês",
      "level": "Profissional Completo"
    },
    {
      "name": "Francês",
      "level": "Proficiência Limitada"
    },
    {
      "name": "Alemão",
      "level": "Básico"
    }
  ]
}
