{
  "name": "Andrey Luiz",
  "title": "Engenheiro Full Stack Sênior",
  "contactInfo": {
    "email": "andreyluiz.developer@gmail.com",
    "phone": "+41 76 503 86 65",
    "location": "Fribourg, Suíça",
    "website": "andreyluiz.com",
    "linkedin": "linkedin.com/in/andreyluiz"
  },
  "summary": "Engenheiro full stack com mais de 9 anos de experiência em todo o stack, especializado em frameworks Javascript, Python e AWS. Melhorou a experiência do usuário e impulsionou o crescimento dos negócios em várias empresas suíças como Timeleap e SonarSource. Aumentou a confiabilidade de 20% para 100% otimizando a conectividade Bluetooth para estações de aluguel. Lançou aplicativos no Google Play e Apple Store, expandindo o alcance da empresa em diferentes países.",
  "skills": [
    {
      "domain": "Frontend",
      "skills": ["React", "SvelteKit", "Next.js", "Phaser", "TailwindCSS"]
    },
    { "domain": "Backend", "skills": ["Node.js", "Python", "Rust"] },
    { "domain": "Bancos de Dados", "skills": ["PostgreSQL", "MongoDB"] },
    { "domain": "DevOps & Cloud", "skills": ["AWS", "Git", "CI/CD"] }
  ],
  "experience": [
    {
      "title": "Engenheiro Full Stack",
      "company": "Timeleap",
      "location": "Suíça",
      "period": {
        "start": "Julho 2024",
        "end": "Janeiro 2025"
      },
      "achievements": [
        "Liderou o desenvolvimento de aplicações descentralizadas usando SvelteKit e TypeScript, gerando mais de 50k CHF em receita nos primeiros meses de operação.",
        "Arquitetou e desenvolveu um portal de staking baseado em Phaser, resultando em mais de 600 jogadores na primeira semana de lançamento."
      ],
      "techStack": [
        "SvelteKit",
        "TypeScript",
        "MongoDB",
        "PostgreSQL",
        "TailwindCSS",
        "Phaser",
        "AWS"
      ]
    },
    {
      "title": "Engenheiro Frontend",
      "company": "Sonar",
      "location": "Suíça",
      "period": {
        "start": "Novembro 2022",
        "end": "Junho 2024"
      },
      "achievements": [
        "Entregou três funcionalidades principais para a seção de projetos do SonarCloud em React, melhorando a integração da Taxonomia de Código Limpo e a educação dos usuários sobre melhores práticas de programação.",
        "Pioneirou a adoção de 8 funcionalidades críticas pela equipe CaYC, otimizando a eficiência do fluxo de trabalho e a colaboração entre equipes.",
        "Migrou a tela de issues do SonarCloud para MIUI usando React, recebendo feedback positivo da liderança sênior por melhorar o fluxo de trabalho diário dos desenvolvedores."
      ],
      "techStack": ["React", "TypeScript", "TailwindCSS", "Git", "AWS"]
    },
    {
      "title": "Engenheiro Full Stack",
      "company": "Equip",
      "location": "Suíça",
      "period": {
        "start": "Junho 2021",
        "end": "Novembro 2022"
      },
      "achievements": [
        "Aprimorou a busca no mapa e os processos de aluguel do aplicativo Equip, reduzindo o tempo de desenvolvimento do protótipo em 3 meses.",
        "Otimizou as capacidades Bluetooth do aplicativo híbrido para conexão com estações de aluguel, aumentando a confiabilidade de 20% para 100%.",
        "Lançou o aplicativo Equip na Play Store e Apple Store, expandindo o alcance da empresa em três países."
      ],
      "techStack": ["Meteor.js", "Svelte", "MongoDB", "Git", "AWS", "Cordova"]
    },
    {
      "title": "Engenheiro Frontend",
      "company": "Scout24 Schweiz AG",
      "location": "Suíça",
      "period": {
        "start": "Fevereiro 2020",
        "end": "Setembro 2021"
      },
      "achievements": [
        "Aprimorou e refatorou o Anibis Messenger usando React e TypeScript, recebendo reações positivas da gerência.",
        "Migrou os serviços de mensagens do Twilio para Sendbird, garantindo adoção total por 100% dos usuários no primeiro mês."
      ],
      "techStack": ["React", "Redux", "TypeScript", "Git", "AWS"]
    },
    {
      "title": "Engenheiro Full Stack",
      "company": "Integer Consulting",
      "location": "Portugal",
      "period": {
        "start": "Fevereiro 2018",
        "end": "Janeiro 2020"
      },
      "achievements": [
        "Conduziu novas funcionalidades para o aplicativo SkyQ (British Sky Broadcasting), melhorando a experiência do usuário e a disponibilidade em todos os países onde o produto estava presente.",
        "Desenvolveu e implementou funcionalidades principais para o SkyQ no PlayStation 4, expandindo o alcance do produto através de lançamentos bem-sucedidos na loja."
      ],
      "techStack": [
        "React",
        "Redux",
        "PostgreSQL",
        "TypeScript",
        "Git",
        "Python"
      ]
    },
    {
      "title": "Engenheiro Frontend",
      "company": "DataRisk",
      "location": "Brasil",
      "period": {
        "start": "Janeiro 2017",
        "end": "Fevereiro 2018"
      },
      "achievements": [
        "Liderou a aplicação inicial de frontend da DataRisk utilizando React e Redux, permitindo que os três primeiros clientes testassem o novo produto inovador de machine learning.",
        "Liderou o desenvolvimento frontend, colaborando com designers para lançar o primeiro produto beta da empresa, garantindo os primeiros clientes."
      ],
      "techStack": ["React", "Redux", "JavaScript", "Git"]
    },
    {
      "title": "Engenheiro Frontend",
      "company": "Resultados Digitais",
      "location": "Brasil",
      "period": {
        "start": "Abril 2016",
        "end": "Dezembro 2016"
      },
      "achievements": [
        "Introduziu funcionalidades principais em JavaScript e jQuery para a equipe de Landing Pages, melhorando a qualidade do produto e a experiência do cliente.",
        "Migrou o editor de landing pages para uma interface WYSIWYG, melhorando a usabilidade e flexibilidade de design, recebendo feedback positivo dos clientes nas primeiras semanas de lançamento."
      ],
      "techStack": ["JavaScript", "jQuery", "Git"]
    },
    {
      "title": "Desenvolvedor Frontend",
      "company": "Kanoah",
      "location": "Brasil",
      "period": {
        "start": "Junho 2015",
        "end": "Dezembro 2015"
      },
      "achievements": [
        "Desenvolveu funcionalidades para um plugin de gerenciamento de testes JIRA usando Angular.js, ajudando a Kanoah a conquistar os primeiros clientes internacionais.",
        "Liderou o desenvolvimento frontend para suites de teste, melhorando a competitividade da Kanoah no mercado."
      ],
      "techStack": ["Angular.js", "JavaScript", "Git"]
    }
  ],
  "certifications": [
    {
      "degree": "Programação Rust: Dos Fundamentos aos Conceitos Avançados com Desenvolvimento Assistido por IA",
      "institution": "LinkedIn",
      "year": "Março 2025",
      "location": "Suíça"
    },
    {
      "degree": "AWS Certified Cloud Practitioner",
      "institution": "Amazon Web Services",
      "year": "Outubro 2023",
      "location": "Suíça"
    }
  ],
  "education": [
    {
      "degree": "Diploma em Engenharia e Desenvolvimento de Software",
      "institution": "Faculdade Unilagos",
      "year": "Dezembro 2011",
      "location": "Brasil"
    }
  ],
  "languages": [
    {
      "name": "Inglês",
      "level": "Profissional Completo"
    },
    {
      "name": "Francês",
      "level": "Proficiência Limitada"
    },
    {
      "name": "Português",
      "level": "Nativo"
    }
  ]
}