{
  "name": "Andrey Luiz",
  "title": "Ingénieur Full Stack Senior",
  "contactInfo": {
    "email": "andreyluiz.developer@gmail.com",
    "phone": "+41 76 503 86 65",
    "location": "Fribourg, Suisse",
    "website": "andreyluiz.com",
    "linkedin": "linkedin.com/in/andreyluiz"
  },
  "summary": "Ingénieur full stack avec plus de 9 ans d'expérience dans le développement, spécialisé dans les frameworks JavaScript, Python et AWS. Amélioration de l'expérience utilisateur et stimulation de la croissance des entreprises dans plusieurs sociétés suisses comme Timeleap et SonarSource. Augmentation de la fiabilité de 20 % à 100 % en optimisant la connectivité Bluetooth pour les stations de location. Lancement d'applications sur Google Play et Apple Store, élargissant la portée de l'entreprise dans différents pays.",
  "skills": [
    {
      "domain": "Frontend",
      "skills": ["React", "SvelteKit", "Next.js", "Phaser", "TailwindCSS"]
    },
    { "domain": "Backend", "skills": ["Node.js", "Python", "Rust"] },
    { "domain": "Bases de Données", "skills": ["PostgreSQL", "MongoDB"] },
    { "domain": "DevOps & Cloud", "skills": ["AWS", "Git", "CI/CD"] }
  ],
  "experience": [
    {
      "title": "Ingénieur Full Stack",
      "company": "Timeleap",
      "location": "Suisse",
      "period": {
        "start": "Juillet 2024",
        "end": "Janvier 2025"
      },
      "achievements": [
        "Dirigé le développement d'applications décentralisées utilisant SvelteKit et TypeScript, générant plus de 50k CHF de revenus dans les premiers mois d'exploitation.",
        "Architecturé et développé un portail de staking basé sur Phaser, attirant plus de 600 joueurs dès la première semaine de lancement."
      ],
      "techStack": [
        "SvelteKit",
        "TypeScript",
        "MongoDB",
        "PostgreSQL",
        "TailwindCSS",
        "Phaser",
        "AWS"
      ]
    },
    {
      "title": "Ingénieur Frontend",
      "company": "Sonar",
      "location": "Suisse",
      "period": {
        "start": "Novembre 2022",
        "end": "Juin 2024"
      },
      "achievements": [
        "Livré trois fonctionnalités clés pour la section projets de SonarCloud en React, améliorant l'intégration de la Taxonomie du Code Propre et l'éducation des utilisateurs sur les meilleures pratiques de programmation.",
        "Pionnier dans l'adoption de 8 fonctionnalités critiques par l'équipe CaYC, optimisant l'efficacité des flux de travail et la collaboration inter-équipes.",
        "Migré l'écran des problèmes de SonarCloud vers MIUI en utilisant React, recevant des retours positifs de la direction pour l'amélioration des flux de travail quotidiens des développeurs."
      ],
      "techStack": ["React", "TypeScript", "TailwindCSS", "Git", "AWS"]
    },
    {
      "title": "Ingénieur Full Stack",
      "company": "Equip",
      "location": "Suisse",
      "period": {
        "start": "Juin 2021",
        "end": "Novembre 2022"
      },
      "achievements": [
        "Amélioré la recherche sur carte et les processus de location de l'application Equip, réduisant le temps de développement du prototype de 3 mois.",
        "Optimisé les capacités Bluetooth de l'application hybride pour la connexion avec les stations de location, augmentant la fiabilité de 20 % à 100 %.",
        "Lancé l'application Equip sur Play Store et Apple Store, étendant la portée de l'entreprise dans trois pays."
      ],
      "techStack": ["Meteor.js", "Svelte", "MongoDB", "Git", "AWS", "Cordova"]
    },
    {
      "title": "Ingénieur Frontend",
      "company": "Scout24 Schweiz AG",
      "location": "Suisse",
      "period": {
        "start": "Février 2020",
        "end": "Septembre 2021"
      },
      "achievements": [
        "Amélioré et refactorisé Anibis Messenger en utilisant React et TypeScript, recevant des réactions positives de la direction.",
        "Migré les services de messagerie de Twilio vers Sendbird, assurant une adoption complète par 100 % des utilisateurs dès le premier mois."
      ],
      "techStack": ["React", "Redux", "TypeScript", "Git", "AWS"]
    },
    {
      "title": "Ingénieur Full Stack",
      "company": "Integer Consulting",
      "location": "Portugal",
      "period": {
        "start": "Février 2018",
        "end": "Janvier 2020"
      },
      "achievements": [
        "Conduit de nouvelles fonctionnalités pour l'application SkyQ (British Sky Broadcasting), améliorant l'expérience utilisateur et la disponibilité dans tous les pays où le produit était présent.",
        "Conçu et déployé des fonctionnalités clés pour SkyQ sur PlayStation 4, étendant la portée du produit via des lancements réussis en magasin."
      ],
      "techStack": [
        "React",
        "Redux",
        "PostgreSQL",
        "TypeScript",
        "Git",
        "Python"
      ]
    },
    {
      "title": "Ingénieur Frontend",
      "company": "DataRisk",
      "location": "Brésil",
      "period": {
        "start": "Janvier 2017",
        "end": "Février 2018"
      },
      "achievements": [
        "Dirigé la première application frontend de DataRisk en utilisant React et Redux, permettant aux trois premiers clients de tester le nouveau produit innovant basé sur l'apprentissage automatique.",
        "Dirigé le développement frontend, collaborant avec les designers pour lancer le premier produit bêta de l'entreprise, sécurisant les premiers clients."
      ],
      "techStack": ["React", "Redux", "JavaScript", "Git"]
    },
    {
      "title": "Ingénieur Frontend",
      "company": "Resultados Digitais",
      "location": "Brésil",
      "period": {
        "start": "Avril 2016",
        "end": "Décembre 2016"
      },
      "achievements": [
        "Introduit des fonctionnalités clés en JavaScript et jQuery pour l'équipe Landing Pages, améliorant la qualité du produit et l'expérience client.",
        "Migré l'éditeur de landing pages vers une interface WYSIWYG, améliorant l'ergonomie et la flexibilité de conception, recevant des retours positifs des clients dès les premières semaines de lancement."
      ],
      "techStack": ["JavaScript", "jQuery", "Git"]
    },
    {
      "title": "Développeur Frontend",
      "company": "Kanoah",
      "location": "Brésil",
      "period": {
        "start": "Juin 2015",
        "end": "Décembre 2015"
      },
      "achievements": [
        "Développé des fonctionnalités pour un plugin de gestion de tests JIRA en utilisant Angular.js, aidant Kanoah à sécuriser ses premiers clients internationaux.",
        "Dirigé le développement frontend pour les suites de test, améliorant la compétitivité de Kanoah sur le marché."
      ],
      "techStack": ["Angular.js", "JavaScript", "Git"]
    }
  ],
  "certifications": [
    {
      "degree": "Programmation Rust : Des Fondamentaux aux Concepts Avancés avec Développement Assisté par IA",
      "institution": "LinkedIn",
      "year": "Mars 2025",
      "location": "Suisse"
    },
    {
      "degree": "AWS Certified Cloud Practitioner",
      "institution": "Amazon Web Services",
      "year": "Octobre 2023",
      "location": "Suisse"
    }
  ],
  "education": [
    {
      "degree": "Diplôme en Ingénierie et Développement de Logiciels",
      "institution": "Faculdade Unilagos",
      "year": "Décembre 2011",
      "location": "Brésil"
    }
  ],
  "languages": [
    {
      "name": "Anglais",
      "level": "Professionnel Complet"
    },
    {
      "name": "Français",
      "level": "Maîtrise Limitée"
    },
    {
      "name": "Portugais",
      "level": "Natif"
    }
  ]
}