{
  "name": "Andrey Luiz",
  "title": "Senior Software Engineer",
  "contactInfo": {
    "email": "andreyluiz.developer@gmail.com",
    "phone": "+41 76 503 86 65",
    "location": "Route de la Gruyère 21, 1700 Fribourg, Switzerland",
    "github": "github.com/andreyluiz",
    "linkedin": "linkedin.com/in/andreyluiz",
    "website": "andreyluiz.com",
    "age": "33 years old",
    "nationality": "Brazilian, B Permit"
  },
  "summary": "Senior Engineer with over 14 years of experience in software development, primarily focused in quality and value for the client. My work spans SaaS, Web3, and Sports, always working closely with Product Owners with an innovative and client-focused vision to drive team results and product value.",
  "qualities": [
    "Ambitious",
    "Solution-oriented",
    "Reliable",
    "Responsible",
    "Focused"
  ],
  "generalSkills": [
    "Develop scalable and maintainable full-stack applications",
    "Collaborate within cross-functional Agile teams",
    "Mentor and guide junior developers",
    "Drive metrics and key performance indicators (KPIs) to measure success"
  ],
  "skills": [
    {
      "domain": "Frontend",
      "skills": ["React", "TailwindCSS", "TypeScript", "Redux", "Phaser.js"]
    },
    {
      "domain": "Mobile",
      "skills": [
        "React Native",
        "Expo",
        "iOS",
        "Android",
        "Apple Store",
        "Google Play"
      ]
    },
    {
      "domain": "Full-Stack & Databases",
      "skills": [
        "Python",
        "FastAPI",
        "Flask",
        "Node.js",
        "Next.js",
        "SvelteKit",
        "Java",
        "MongoDB",
        "PostgreSQL"
      ]
    },
    {
      "domain": "AI Tools",
      "skills": [
        "Cursor",
        "Cline",
        "Gemini CLI",
        "Claude",
        "Gemini",
        "OpenAI",
        "ChatGPT"
      ]
    },
    {
      "domain": "Tools & Platforms",
      "skills": ["Git", "AWS", "CI/CD", "Docker", "Supabase"]
    }
  ],
  "experience": [
    {
      "title": "Full Stack Engineer",
      "company": "Timeleap",
      "location": "Switzerland",
      "period": {
        "start": "2024",
        "end": "2025"
      },
      "achievements": [
        "Developed Web3 projects using SvelteKit, integrating with many types of blockchains and smart contracts.",
        "Implemented a React Native wallet application for a big client from India, integrating with a custom made blockchain and securing the first stakes.",
        "Crafted a game using Phaser.js for a staking portal, getting positive feedback from the client and granting 600 players in the first month."
      ]
    },
    {
      "title": "Senior Front-end Developer",
      "company": "Sonar",
      "location": "Switzerland",
      "period": {
        "start": "2022",
        "end": "2024"
      },
      "achievements": [
        "Delivered many critical features for SonarCloud's project section in React, improving Clean Code Taxonomy integration and user education on coding best practices.",
        "Pioneered CaYC team's adoption of more than 10 critical features, using React and TypeScript, ensuring user education and achieving proper project configuration in less than 4 months.",
        "Delivered full coverage tests for each and every feature, to improve code reliability and confidence in deployments, raising coverage close to 90%.",
        "Driven team autonomy on a horizontal hierarchy, fostering a culture of collaboration and innovation, and improving team dynamics."
      ]
    },
    {
      "title": "Senior Full Stack Developer",
      "company": "Equip",
      "location": "Switzerland",
      "period": {
        "start": "2021",
        "end": "2022"
      },
      "achievements": [
        "Led the Equip app prototype development using Svelte and Meteor.js, improving reliability and performance, and reducing prototype development time by 3 months.",
        "Enhanced Equip app's map search and rental processes, improving reliability and securing the first test users.",
        "Released Equip app on Play Store and Apple Store, expanding the company's reach in three countries.",
        "Refactored the Equip app's codebase using React Native and TypeScript, reducing the time to iterate on new features.",
        "Collaborated closely with the Product Owner to ensure the product met user needs and business goals, enhancing product value and user satisfaction."
      ]
    },
    {
      "title": "Senior Front-end Developer",
      "company": "Scout24",
      "location": "Switzerland",
      "period": {
        "start": "2020",
        "end": "2021"
      },
      "achievements": [
        "Enhanced and refactored Anibis Messenger using React and TypeScript, getting positive reactions from management.",
        "Migrated messaging services from Twilio to Sendbird, ensuring full adoption by 100% of users in the first month.",
        "Acted as a Scrum Master for the team, leading daily standups and sprint planning sessions, improving team collaboration and productivity."
      ]
    },
    {
      "title": "Senior Front-end Developer",
      "company": "Integer Consulting",
      "location": "Portugal",
      "isPrevious": true,
      "period": {
        "start": "2018",
        "end": "2020"
      },
      "achievements": [
        "Formulated new features for the SkyQ application (British Sky Broadcasting), using React and Redux, improving load times on old TVs from 20 to 1 second.",
        "Authored and deployed critical features for SkyQ on PlayStation 4, expanding product reach and user satisfaction with successful store releases.",
        "Crafted an internal tool in Python to process security camera logs, enhancing data analysis and security monitoring."
      ]
    },
    {
      "title": "Front-end Developer",
      "company": "DataRisk",
      "location": "Brazil",
      "isPrevious": true,
      "period": {
        "start": "2017",
        "end": "2018"
      },
      "achievements": [
        "Researched and started the company's main front end application from scratch using React and Redux, kick starting the company's business idea and vision.",
        "Partnered back-end developers to create a reliable application, making the company's first product available for beta testing by two customers.",
        "Played a crucial role as the first front-end developer, collaborating closely with a designer to expand the application's beta testing, a significant milestone for the company's growth."
      ]
    },
    {
      "title": "Front-end Developer",
      "company": "Resultados Digitais",
      "location": "Brazil",
      "isPrevious": true,
      "period": {
        "start": "2016",
        "end": "2016"
      },
      "achievements": [
        "Conceived important features in JavaScript and jQuery for the Landing Pages squad, ensuring quality and customer support.",
        "Integrated the effort to migrate the landing pages editor to a WYSIWYG editor, improving the user experience while creating landing pages.",
        "Collaborated with decisions and actions for the front end chapter of the company, always ensuring the front end development had a bright future ahead."
      ]
    },
    {
      "title": "Front-end Developer",
      "company": "Kanoah",
      "location": "Brazil",
      "isPrevious": true,
      "period": {
        "start": "2015",
        "end": "2015"
      },
      "achievements": [
        "Implemented features for a JIRA plugin for testing management using Angular.js, giving the company the first international customers.",
        "Led the front end development of the core feature of testing suites, allowing the company to outperform competitors."
      ]
    },
    {
      "title": "Full Stack Developer",
      "company": "Softplan",
      "location": "Brazil",
      "isPrevious": true,
      "isHidden": true,
      "period": {
        "start": "2014",
        "end": "2015"
      },
      "achievements": [
        "Engineered critical features for a Java-based file processing tool, directly enhancing data analysis capabilities and boosting the company's reputation in financial software.",
        "Created and optimized queries on PostgreSQL database for fast data querying.",
        "Pioneered on JavaScript and CSS rich interfaces, giving users a more intuitive and user-friendly experience."
      ]
    }
  ],
  "certifications": [
    {
      "degree": "AWS Certified Cloud Practitioner",
      "institution": "Amazon Web Services",
      "year": "2023",
      "location": "Switzerland"
    }
  ],
  "education": [
    {
      "degree": "Bachelor in Software Engineering and Development",
      "institution": "Unilagos University",
      "year": "2011",
      "location": "Brazil",
      "topics": "Applied Mathematics, Algorithms, Machine Learning, Distributed Computing, Software Development, Web Development, Database Management, Project Management, UML"
    }
  ],
  "languages": [
    {
      "name": "English",
      "level": "C2"
    },
    {
      "name": "French",
      "level": "B2"
    },
    {
      "name": "Portuguese",
      "level": "C2"
    }
  ],
  "personalityTraits": [
    "Ambitious",
    "Calm",
    "Focused",
    "Reliable",
    "Quick learner",
    "Solution-oriented",
    "Respectful",
    "Responsible",
    "Communicative"
  ]
}
